[
  {
    "hadith": "الحديث الأول: عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: «إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ». (رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبه البخاري الجعفي، وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري، في صحيحيهما اللذين هما أصح الكتب المصنفة).",
    "description": "الشرح\nالحديث الأول: حديث عظيم، وقاعدة من قواعد الدين، حتى قال بعض أهل العلم : إنه ثلث الإسلام، وقال الإمام الشافعي رحمه الله : يدخل في سبعين باباً من أبواب الفقه .\nوقال الإمام أحمد رحمه الله : أصول الإسلام على ثلاثة أحاديث: حديث عمر: «إنما الأعمال بالنيات» وحديث عائشة: «من أحدث في أمرنا هذا ما ليس منه فهو رد» وحديث النعمان بن بشير : «الحلال بين والحرام بين».\nولأهميته، فقد صدر به المؤلفون كتبهم ، فصدر به البخاري صحيحه ، وصدر به النووي كتابه رياض الصالحين، وكتابه الأذكار، وكذلك كتابه الأربعين النووية.\nوهذا الحديث في الأعمال الظاهرة والباطنة، فالأعمال قسمان : أعمال ظاهرة بالجوارح، وأعمال باطنة بالقلوب.\nوقوله صلى الله عليه وسلم : «إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ» (إنما) أداة حصر تفيد حصر الشيء في الشيء المذكور، أو إثبات الحكم في المذكور ونفيه عما سواه.\nفالأعمال محصورة بالنيات، فلا عمل إلا بنية.\nوالمراد بالأعمال هنا: الأعمال التي يُتعبد بها لله عز وجل، فلا تصح ولا تعتبر شرعاً إلا بالنية...\n(وإنما) هنا للحصر أيضاً.\n«لِكُلِّ امْرِئٍ مَا نَوَى» أي : ليس للإنسان من عمله إلا ما نواه، فإذا نوى شيئاً حصل له، وإذا لم ينوه لم يحصل له.\nفالجملة الأولى : بيان ما به يعتبر العمل وهو النية.\nوالجملة الثانية : بيان ما لمن العمل وهو النية.\nفالأولى : لبيان شرط صحة العمل.\nوالثانية : لبيان ما الذي يحصل للإنسان من هذا العمل.\nمثال ذلك: رجل صلى صلاة الظهر بنية التقرب إلى الله بأداء هذه الفريضة، فصلاته صحيحة وحصل له ما نواه وهو الأجر والثواب.\nورجل آخر صلى ولم ينو، كأن رأى الناس يصلون فقام يصلي مثلهم، ولم ينو شيئاً، فهذا عمله باطل، لأنه لا نية له.\nورجل ثالث صلى بنية الرياء ـ والعياذ بالله ـ ليراه الناس فيمدحوه، فهذا عمله باطل ولا يحصل له ما نواه؛ لأنه لا يريد وجه الله والدار الآخرة.\n«فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ» هذا تفريع على ما سبق، والمثال الذي ذكره النبي صلى الله عليه وسلم هو الهجرة وهي : الانتقال من بلد الشرك إلى بلد الإسلام.\n«وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا» أي: يحصل عليها «أَوْ امْرَأَةٍ يَنْكِحُهَا» أي: يتزوجها «فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ» أي: فجزاؤه ما هاجر إليه من أمر الدنيا أو المرأة التي أراد نكاحها، ولا نصيب له من الأجر والثواب.\nمن فوائد هذا الحديث:\n1 - أنه لا عمل إلا بنية.\n2 - أنه لا أجر إلا بنية.\n3 - أن الأعمال بحسب ما ينوي العامل.\n4 - أن النية محلها القلب؛ لأن النية هي القصد والإرادة ولا تكون إلا بالقلب.\n5 - الإخلاص لله تعالى في جميع الأعمال.\n6 - أن الهجرة من بلد الشرك إلى بلد الإسلام من أفضل الأعمال؛ لأن النبي صلى الله عليه وسلم ذكرها مثالاً.\n7 - أن هذا الحديث قاعدة عظيمة من قواعد الدين؛ ولهذا قال العلماء: هو ثلث العلم أو ربعه."
  },
  {
    "hadith": "الحديث الثاني: عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ : بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه وسلم ، فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا» . قَالَ : صَدَقْت . فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ! قَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ . قَالَ: «أَنْ تُؤْمِنَ بِاَللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ» . قَالَ: صَدَقْت . قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ . قَالَ: «أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك» . قَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ . قَالَ: «مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ» . قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ» . ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ: «يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟» قُلْتُ : اللَّهُ وَرَسُولُهُ أَعْلَمُ . قَالَ: «فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ». (رواه مسلم).",
    "description": "الشرح\nالحديث الثاني حديث عظيم جداً، لأنه يتضمن وصف مجيء جبريل عليه الصلاة والسلام إلى النبي صلى الله عليه وسلم على وجه لا يعرفه أحد ، يسأله عن أعظم مسائل الدين: عن الإسلام، والإيمان، والإحسان وعن الساعة وأشراطها.\nوهذا الحديث يسميه العلماء (أم السنة) كما تسمى الفاتحة (أم القرآن)، وذلك لأن أصول السنة ترجع إليه.\n«بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ» هذا الرجل هو جبريل عليه السلام.\n«شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ» وهذا وصف يدل على كمال هيئته ونظافته.\n«لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ» لأنه لو كان مسافراً لكان أشعث أغبر.\n«وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ» وهذا يعني أنه ليس من أهل المدينة.\nفهذان الوصفان المتناقضان يدلان على أن هذا الرجل ليس ببشر عادي.\n«حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه وسلم ، فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ» هذه جلسة المتعلم المتأدب.\n«وَقَالَ: يَا مُحَمَّدُ» لم يقل: يا رسول الله، وهذا لئلا يعرفه الناس.\n«أَخْبِرْنِي عَنْ الْإِسْلَامِ» الإسلام: هو الاستسلام لله ظاهراً وباطناً، وهو دين الله الذي بعث به الرسل.\nففسره النبي صلى الله عليه وسلم بأركانه الخمسة الظاهرة: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وحج البيت لمن استطاع إليه سبيلاً.\n«قَالَ : صَدَقْت» أي: صدقت فيما قلت.\n«فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ» لأنه يدل على أنه عالم بما يسأل عنه.\n«قَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ» الإيمان: هو التصديق المستلزم للقبول والإذعان.\nففسره النبي صلى الله عليه وسلم بأصوله الستة الباطنة: الإيمان بالله، وملائكته، وكتبه، ورسله، واليوم الآخر، والقدر خيره وشره.\n«قَالَ: صَدَقْت . قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ» الإحسان: هو أعلى مراتب الدين، وهو أن يفعل الإنسان الطاعة بإحسان وإتقان.\nففسره النبي صلى الله عليه وسلم بقوله: «أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ» وهذه مرتبة المشاهدة.\n«فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك» وهذه مرتبة المراقبة.\n«قَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ» أي: متى تقوم الساعة؟\n«قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ» أي: علمي وعلمك بها سواء، وكلاهما لا يعلم متى تقوم الساعة، وهذا من العلم الذي استأثر الله به.\n«قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا» أي: علاماتها التي تدل على قربها.\n«قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا» أي: أن تلد المملوكة سيدتها. وهذا له عدة تفسيرات، منها: كثرة السبي في آخر الزمان، فتلد الأمة بنتاً لسيدها فتكون هذه البنت حرة بمنزلة السيدة والأم مملوكة. وقيل غير ذلك.\n«وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ» أي: ترى أهل البادية الفقراء الذين لا يملكون شيئاً، يتنافسون في بناء القصور العالية. وهذا قد وقع.\n«ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا» أي: زمناً.\n«ثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟ قُلْتُ : اللَّهُ وَرَسُولُهُ أَعْلَمُ» وهذا من أدب الصحابة مع الرسول صلى الله عليه وسلم.\n«قَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ» سمى هذه الأمور ديناً لأن الدين كله يرجع إليها.\nمن فوائد هذا الحديث:\n1 - بيان مراتب الدين الثلاث: الإسلام، والإيمان، والإحسان.\n2 - الفرق بين الإسلام والإيمان عند اجتماعهما، وأن الإسلام يتعلق بالأعمال الظاهرة، والإيمان يتعلق بالأعمال الباطنة.\n3 - إذا أفرد أحدهما دخل فيه الآخر.\n4 - بيان أركان الإسلام الخمسة.\n5 - بيان أصول الإيمان الستة.\n6 - بيان حقيقة الإحسان ومراتبه.\n7 - أن علم الساعة مما استأثر الله به.\n8 - بيان بعض أمارات الساعة.\n9 - جواز سؤال المتعلم للعالم وإن كان يعلم الجواب؛ ليتعلم الحاضرون.\n10- حسن تعليم النبي صلى الله عليه وسلم وأدب المتعلم."
  },
  {
      "hadith": "الحديث الثالث: عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: «بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ». (رواه البخاري ومسلم).",
      "description": "الشرح\nالحديث الثالث: يشبه جزءاً من الحديث الثاني وهو تفسير الإسلام.\n«بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ» أي: أسس على خمس دعائم، شبه الإسلام بالبناء وشبه هذه الخصال بالدعائم.\n«شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ» هاتان الشهادتان ركن واحد؛ لأنهما أساس صحة الأعمال وقبولها.\nومعنى «لا إله إلا الله»: لا معبود حق إلا الله. وكل ما عبد من دون الله فهو باطل.\nومعنى «أن محمداً رسول الله»: التصديق برسالته وطاعته فيما أمر، وتصديقه فيما أخبر، واجتناب ما نهى عنه وزجر، وأن لا يعبد الله إلا بما شرع.\n«وَإِقَامِ الصَّلَاةِ» أي: الإتيان بها قائمة مستقيمة على الوجه المطلوب شرعاً.\n«وَإِيتَاءِ الزَّكَاةِ» أي: إعطائها لمستحقيها. وهي عبادة مالية فرضها الله في أموال الأغنياء.\n«وَحَجِّ الْبَيْتِ» أي: قصد البيت الحرام لأداء المناسك.\n«وَصَوْمِ رَمَضَانَ» أي: الإمساك بنية عن المفطرات من طلوع الفجر إلى غروب الشمس في شهر رمضان.\nفي هذا الحديث تقديم الحج على الصوم، وفي حديث جبريل تقديم الصوم على الحج. ولا تنافي بينهما، فكلها أركان لا بد منها. والترتيب هنا قد يكون حسب ما حضر الراوي.\nمن فوائد هذا الحديث:\n1 - أن الإسلام مبني على هذه الأركان الخمسة.\n2 - تشبيه المعنويات بالمحسوسات ليتقرر المعنى في الذهن.\n3 - أهمية هذه الأركان الخمسة وعظم شأنها.\n4 - أن بقية خصال الإسلام كالمكملات لهذا البناء."
  },
  {
      "hadith": "الحديث الرابع: عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ الْمَصْدُوقُ: «إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا». (رواه البخاري ومسلم).",
      "description": "الشرح\nالحديث الرابع: يتعلق بأطوار خلق الإنسان وما يكتب له وهو في بطن أمه، وخاتمته.\nقول ابن مسعود رضي الله عنه: «وَهُوَ الصَّادِقُ الْمَصْدُوقُ» الصادق: في قوله. المصدوق: فيما يوحى إليه.\n«إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ» أي: يجمع الله مادة خلقه.\n«أَرْبَعِينَ يَوْمًا نُطْفَةً» النطفة: هي الماء الصافي، والمراد بها المني.\n«ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ» العلقة: قطعة دم جامدة. (مثل ذلك) أي: أربعين يوماً أخرى.\n«ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ» المضغة: قطعة لحم بقدر ما يمضغ. (مثل ذلك) أي: أربعين يوماً ثالثة. فمجموع الأطوار الثلاثة 120 يوماً.\n«ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ» أي: الموكل بالأرحام.\n«فَيَنْفُخُ فِيهِ الرُّوحَ» أي: يوصلها إلى بدنه فتسري فيه الحياة.\n«وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ» ما قدر له من الرزق قليلاً أو كثيراً.\n«وَأَجَلِهِ» متى يموت.\n«وَعَمَلِهِ» ما سيعمله من خير أو شر.\n«وَشَقِيٍّ أَمْ سَعِيدٍ» أي: يكتب هل هو من أهل الشقاوة (النار) أو السعادة (الجنة).\nوهذا هو التقدير العمري، وهو أحد أنواع تقدير الله لأفعال العباد.\n«فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ» هذا قسم من ابن مسعود، وقيل مرفوع من كلام النبي صلى الله عليه وسلم.\n«إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ» فيما يظهر للناس.\n«حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ» أي: يقرب أجله.\n«فَيَسْبِقُ عَلَيْهِ الْكِتَابُ» أي: ما كتب عليه في التقدير الأزلي.\n«فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا» وهذا بسبب دسيسة في قلبه لا يعلمها الناس، والعياذ بالله.\n«وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ» فيما يظهر للناس.\n«حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ»\n«فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا» وهذا بفضل الله ومنته عليه بأن يوفقه للتوبة والعمل الصالح قبل موته.\nمن فوائد هذا الحديث:\n1 - بيان أطوار خلق الإنسان في بطن أمه.\n2 - أن الروح تنفخ في الجنين بعد 120 يوماً.\n3 - إثبات الملائكة وأن منهم من هو موكل بالأرحام.\n4 - إثبات القدر وأن كل شيء مكتوب.\n5 - أن الأعمال بالخواتيم.\n6 - الخوف من سوء الخاتمة، وعدم الاغترار بالعمل.\n7 - أن السعادة والشقاوة بيد الله، وقد سبقت في الكتاب.\n8 - أن الإنسان لا يدري ما يختم له به."
  },
  {
    "hadith": "الحديث الخامس: عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ». (رواه البخاري ومسلم). وفي رواية لمسلم: «مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ».",
    "description": "الشرح\nالحديث الخامس: هذا الحديث أصل عظيم من أصول الإسلام، وهو ميزان للأعمال الظاهرة.\n«مَنْ أَحْدَثَ» أي: أنشأ واخترع.\n«فِي أَمْرِنَا هَذَا» أي: في ديننا وشرعنا.\n«مَا لَيْسَ مِنْهُ» أي: شيئاً ليس من الدين في أصله أو وصفه.\n«فَهُوَ رَدٌّ» أي: مردود على صاحبه، غير مقبول.\nالرواية الثانية: «مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا» أعم من الأولى، فتشمل من أحدث البدعة بنفسه أو تابع غيره فيها.\nوالبدعة: هي كل عبادة لم يشرعها الله ورسوله صلى الله عليه وسلم.\nوالبدع كلها ضلالة ومردودة على أصحابها.\nمثال البدعة: الاحتفال بالمولد النبوي، أو ليلة الإسراء والمعراج، أو ليلة النصف من شعبان، أو التعبد بصلوات أو أذكار بهيئات أو أعداد لم ترد بها السنة.\nأما الأمور الدنيوية كالصناعات والاختراعات الحديثة، فلا تدخل في معنى البدعة الشرعية المذمومة.\nمن فوائد هذا الحديث:\n1 - أن كل بدعة في الدين فهي مردودة.\n2 - النهي عن الابتداع في الدين والتحذير منه.\n3 - أن العبادة لا تقبل إلا إذا كانت خالصة لله وموافقة لسنة رسول الله صلى الله عليه وسلم.\n4 - أن الدين كامل لا يحتاج إلى زيادة.\n5 - أهمية اتباع السنة والتمسك بها."
  },
  {
    "hadith": "الحديث السادس: عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: «إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقَدْ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث السادس: حديث عظيم من قواعد الدين وأصول الأحكام.\n«إنَّ الْحَلَالَ بَيِّنٌ» أي: واضح لا اشتباه فيه. وهو ما نص الله ورسوله على حله.\n«وَإِنَّ الْحَرَامَ بَيِّنٌ» أي: واضح لا اشتباه فيه. وهو ما نص الله ورسوله على حرمته.\n«وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ» أي: أمور ليست بواضحة الحل أو الحرمة؛ لخفاء دلالتها أو تعارض الأدلة فيها.\n«لَا يَعْلَمُهُنَّ» أي: لا يعلم حكمها «كَثِيرٌ مِنْ النَّاسِ» ومن الناس من يعلمها وهم العلماء الراسخون.\n«فَمَنْ اتَّقَى الشُّبُهَاتِ» أي: ابتعد عنها وتجنبها.\n«فَقَدْ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ» أي: طلب البراءة والسلامة لدينه من الإثم، ولعرضه من كلام الناس فيه وطعنهم.\n«وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ» أي: من تساهل في الأمور المشتبهة ولم يبال بها، فإنه بذلك يتجرأ شيئاً فشيئاً حتى يقع في الحرام الواضح.\n«كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى» الحمى: هو المكان المحمي الذي يمنع غير مالكه من رعي ماشيته فيه.\n«يُوشِكُ أَنْ يَرْتَعَ فِيهِ» أي: يقرب أن تدخل ماشيته في هذا الحمى المحظور.\n«أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى» هذا تنبيه على أن الملوك يجعلون لأنفسهم حمى يمنعون الناس منه.\n«أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ» أي: ما حرمه الله على عباده هو حمى الله الذي يجب اجتنابه وعدم القرب منه.\n«أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً» قطعة لحم صغيرة بقدر ما يمضغ.\n«إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ» أي: إذا صلح القلب بالإيمان والتقوى، صلحت أعمال الجوارح كلها.\n«وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ» أي: إذا فسد القلب بالكفر والنفاق والمعاصي، فسدت أعمال الجوارح كلها.\n«أَلَا وَهِيَ الْقَلْبُ» فالقلب هو ملك الأعضاء، والأعضاء جنوده، فإذا صلح الملك صلحت الجنود، وإذا فسد الملك فسدت الجنود.\nمن فوائد هذا الحديث:\n1 - انقسام الأمور إلى ثلاثة أقسام: حلال بين، وحرام بين، ومشتبه بينهما.\n2 - الحث على الورع وترك الشبهات.\n3 - أن ترك الشبهات سبب لسلامة الدين والعرض.\n4 - أن التساهل في الشبهات يجر إلى الوقوع في الحرام.\n5 - ضرب الأمثال لتقريب المعاني وتوضيحها.\n6 - أن صلاح أعمال الجوارح وفسادها تابع لصلاح القلب وفساده.\n7 - عظم شأن القلب وأهمية إصلاحه."
  },
  {
    "hadith": "الحديث السابع: عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: «الدِّينُ النَّصِيحَةُ». قُلْنَا: لِمَنْ؟ قَالَ: «لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ». (رواه مسلم).",
    "description": "الشرح\nالحديث السابع: يبين أن عماد الدين وقوامه هو النصيحة.\n«الدِّينُ النَّصِيحَةُ» هذا من باب تسمية الشيء بأهم أجزائه، والمعنى: أن النصيحة هي الجزء الأعظم من الدين.\nوالنصيحة: كلمة جامعة معناها حيازة الحظ للمنصوح له. وهي إرادة الخير للمنصوح له وفعله.\n«قُلْنَا: لِمَنْ؟» أي: لمن تكون هذه النصيحة؟\n«قَالَ: لِلَّهِ» النصيحة لله تكون بالإيمان به ونفي الشريك عنه، وترك الإلحاد في صفاته، ووصفه بصفات الكمال والجلال، والقيام بطاعته واجتناب معصيته، والحب فيه والبغض فيه، وجهاد من كفر به، والاعتراف بنعمته وشكره عليها، والإخلاص في جميع الأمور.\n«وَلِكِتَابِهِ» النصيحة لكتابه تكون بالإيمان بأنه كلام الله تعالى وتنزيله، لا يشبهه شيء من كلام الخلق، وتعظيمه وتلاوته حق تلاوته، والوقوف مع أحكامه، وتفهم علومه وأمثاله، والعمل بمحكمه والتسليم لمتشابهه، ونشر علومه.\n«وَلِرَسُولِهِ» النصيحة لرسوله صلى الله عليه وسلم تكون بتصديقه فيما جاء به، وطاعته فيما أمر ونهى، وتوقيره وتعظيمه، ونصرته حياً وميتاً، وإحياء سنته ونشرها، والتخلق بأخلاقه وآدابه.\n«وَلِأَئِمَّةِ الْمُسْلِمِينَ» هم الولاة والعلماء. والنصيحة لهم تكون بمعاونتهم على الحق وطاعتهم فيه، وأمرهم به وتذكيرهم برفق، والصلاة خلفهم والجهاد معهم، والدعاء لهم بالصلاح، وعدم الخروج عليهم بالسيف إلا أن يروا كفراً بواحاً عندهم فيه من الله برهان.\n«وَعَامَّتِهِمْ» أي: لعامة المسلمين. والنصيحة لهم تكون بإرشادهم لمصالحهم في آخرتهم ودنياهم، وتعليمهم ما يجهلون، وستر عوراتهم، وسد خلاتهم، ودفع المضار عنهم وجلب المنافع لهم، وأمرهم بالمعروف ونهيهم عن المنكر برفق وإخلاص، والشفقة عليهم، وتوقير كبيرهم ورحمة صغيرهم، وأن يحب لهم ما يحب لنفسه ويكره لهم ما يكره لنفسه.\nمن فوائد هذا الحديث:\n1 - عظم شأن النصيحة وأنها عماد الدين.\n2 - بيان الجهات التي تكون لها النصيحة.\n3 - وجوب النصيحة لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم.\n4 - أن النصيحة تكون بالقلب واللسان والجوارح."
  },
  {
    "hadith": "الحديث الثامن: عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث الثامن: في بيان عصمة دم المسلم وماله بإقامة أركان الإسلام الظاهرة.\n«أُمِرْتُ» الآمر هو الله عز وجل.\n«أَنْ أُقَاتِلَ النَّاسَ» المراد بالناس هنا المشركون الذين لا يدينون بالإسلام.\n«حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ» أي: حتى ينطقوا بالشهادتين ويدخلوا في الإسلام.\n«وَيُقِيمُوا الصَّلَاةَ» أي: يؤدوها بأركانها وشروطها وواجباتها.\n«وَيُؤْتُوا الزَّكَاةَ» أي: يعطوها لمستحقيها.\nوهذه الثلاثة هي أهم أركان الإسلام العملية الظاهرة بعد الشهادتين.\n«فَإِذَا فَعَلُوا ذَلِكَ» أي: أتوا بالشهادتين وأقاموا الصلاة وآتوا الزكاة.\n«عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ» أي: منعوا وحفظوا مني دماءهم وأموالهم، فلا يجوز التعرض لها بقتل أو أخذ مال.\n«إلَّا بِحَقِّ الْإِسْلَامِ» أي: إلا إذا ارتكبوا ما يوجب حداً أو قصاصاً أو تعزيراً مما شرعه الإسلام، كالردة وقتل النفس المحرمة والزنا بعد الإحصان وترك الصلاة وتارك الزكاة الممتنع عن أدائها بالقوة، فهؤلاء لا عصمة لهم.\n«وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى» أي: أما بواطنهم وسرائرهم، فالله هو الذي يتولى حسابهم عليها يوم القيامة. أما نحن فنحكم بالظاهر.\nمن فوائد هذا الحديث:\n1 - وجوب قتال المشركين حتى يدخلوا في الإسلام ويلتزموا شرائعه.\n2 - أن الإسلام يعصم الدم والمال.\n3 - أن الإقرار بالشهادتين وإقام الصلاة وإيتاء الزكاة هو علامة الدخول في الإسلام الظاهرة.\n4 - أن من أتى بهذه الأركان حكم بإسلامه ظاهراً، ووكلت سريرته إلى الله.\n5 - جواز قتل المسلم أو أخذ ماله بحق الإسلام (كالقصاص والحدود).\n6 - عظم شأن الصلاة والزكاة وأنهما قرينتا الشهادتين."
  },
    {
    "hadith": "الحديث التاسع: عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: «مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ؛ فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث التاسع: قاعدة مهمة في التعامل مع أوامر الشرع ونواهيه.\n«مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ» أي: كل ما نهى عنه الرسول صلى الله عليه وسلم فيجب تركه والابتعاد عنه تماماً، دون قيد أو شرط.\n«وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ» أي: ما أمر به الرسول صلى الله عليه وسلم فيجب فعله حسب القدرة والاستطاعة. وهذا قيد في فعل المأمورات، وهو مبني على القاعدة الشرعية: {لا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا} [البقرة: 286].\nفالنهي يجب اجتنابه كله، لأن الترك مقدور عليه دائماً. أما الأمر فيفعل منه المستطاع، لأن الفعل قد تعجز عنه النفس.\nمثال: نهى عن شرب الخمر، فيجب تركه بالكلية. أمر بالصلاة قائماً، فمن لم يستطع صلى جالساً، فإن لم يستطع فعلى جنب.\n«فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ» أي: الأمم السابقة.\n«كَثْرَةُ مَسَائِلِهِمْ» أي: سؤالهم عن أشياء لم تفرض عليهم، أو سؤال التعنت والتكلف.\n«وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ» أي: مخالفتهم لأنبيائهم وعدم الانقياد لهم.\nفهذان سببان لهلاك الأمم: التنطع في السؤال، ومخالفة الرسل.\nمن فوائد هذا الحديث:\n1 - وجوب اجتناب جميع المنهيات.\n2 - وجوب فعل الأوامر حسب الاستطاعة.\n3 - أن ترك المنهيات آكد من فعل المأمورات عند التعارض وعدم القدرة على الجمع؛ لأن النهي يجب اجتنابه بالكلية.\n4 - يسر الشريعة الإسلامية ومراعاتها لأحوال المكلفين.\n5 - التحذير من كثرة السؤال فيما لا يعني ومن سؤال التعنت.\n6 - التحذير من مخالفة الأنبياء والرسل.\n7 - أن كثرة المسائل والاختلاف على الأنبياء من أسباب هلاك الأمم."
  },
  {
    "hadith": "الحديث العاشر: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: {يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا} [المؤمنون: 51]، وَقَالَ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ} [البقرة: 172]. ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ، يَا رَبِّ، وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لِذَلِكَ؟». (رواه مسلم).",
    "description": "الشرح\nالحديث العاشر: في أهمية الكسب الحلال وأثره في قبول العمل وإجابة الدعاء.\n«إنَّ اللَّهَ طَيِّبٌ» أي: منزه ومقدس عن النقائص والعيوب. وقيل: طيب في ذاته وصفاته وأفعاله.\n«لَا يَقْبَلُ إلَّا طَيِّبًا» أي: لا يقبل من الأعمال والأموال والأقوال إلا ما كان طيباً حلالاً خالصاً من شوائب الحرام والرياء.\n«وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ» هذا يدل على شرف المؤمنين وأن الله أمرهم بما أمر به أشرف خلقه وهم المرسلون.\n«فَقَالَ تَعَالَى: {يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا}» أمر الرسل بأكل الطيبات (الحلال) وشكر ذلك بالعمل الصالح.\n«وَقَالَ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ}» أمر المؤمنين كذلك بأكل الطيبات.\nفدلت الآيتان على أن أكل الحلال معين على العمل الصالح ومطلوب من الرسل والمؤمنين.\n«ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ» السفر من أسباب إجابة الدعاء.\n«أَشْعَثَ أَغْبَرَ» أي: متلبداً شعره، مغبراً لونه وهيئته، وهذا من أسباب رقة القلب وإجابة الدعاء، لأنه يدل على التذلل والانكسار لله.\n«يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ» رفع اليدين في الدعاء من آدابه وأسباب إجابته.\n«يَا رَبِّ، يَا رَبِّ» الإلحاح في الدعاء وتكرار اسم الرب من أسباب الإجابة.\nفهذا الرجل قد اجتمعت فيه عدة أسباب لإجابة الدعاء: السفر، والتذلل (أشعث أغبر)، ورفع اليدين، والإلحاح باسم الرب.\n«وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ» أي: أن كل ما يقوم به بدنه وينبت عليه لحمه من حرام.\n«فَأَنَّى يُسْتَجَابُ لِذَلِكَ؟» أي: كيف يستجاب لمن هذه حاله؟ والاستفهام هنا للاستبعاد والتعجب، أي: هو بعيد عن إجابة دعائه بسبب أكله الحرام.\nمن فوائد هذا الحديث:\n1 - إثبات صفة الطيب لله تعالى.\n2 - أن الله لا يقبل من الصدقات إلا ما كان من كسب طيب حلال.\n3 - أن الله لا يقبل من الأعمال إلا ما كان طيباً خالصاً لوجهه موافقاً لشرعه.\n4 - أن أكل الحلال الطيب معين على العمل الصالح.\n5 - أهمية الكسب الحلال والتحذير من الحرام.\n6 - أن أكل الحرام من أعظم موانع قبول العمل وإجابة الدعاء.\n7 - بيان بعض أسباب إجابة الدعاء: السفر، والتذلل والانكسار، ورفع اليدين، والإلحاح.\n8 - أن اجتماع أسباب الإجابة قد لا ينفع إذا وجد مانع قوي كأكل الحرام."
  },
  {
    "hadith": "الحديث الحادي عشر: عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم : «دَعْ مَا يُرِيبُكَ إلَى مَا لَا يُرِيبُكَ». (رواه الترمذي والنسائي، وقال الترمذي: حديث حسن صحيح).",
    "description": "الشرح\nالحديث الحادي عشر: قاعدة مهمة في باب الورع وترك الشبهات.\n«دَعْ مَا يُرِيبُكَ» أي: اترك ما تشك في حله أو حرمته، أو في كونه حسناً أو قبيحاً، أو في كونه صدقاً أو كذباً. والريبة هي الشك والقلق.\n«إلَى مَا لَا يُرِيبُكَ» أي: وانتقل إلى ما تطمئن إليه نفسك ولا تشك فيه.\nفإذا اشتبه عليك أمر، هل هو حلال أم حرام؟ فدعه اتقاءً للشبهة، وانتقل إلى أمر لا شك فيه.\nوهذا الحديث يتفق مع حديث النعمان بن بشير: «فَمَنْ اتَّقَى الشُّبُهَاتِ فَقَدْ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ». فكلاهما يأمر بترك الشبهات.\nوهذا لا يعني ترك كل ما فيه أدنى شك، بل المراد الشك القوي المبني على أمارة، أو الشك في الأمور التي الأصل فيها الحظر، أو التي يغلب على الظن حرمتها.\nأما الوساوس والشكوك التي لا تستند إلى دليل فلا يلتفت إليها.\nمن فوائد هذا الحديث:\n1 - الحث على الورع وترك الشبهات.\n2 - أن السلامة في الدين والعرض تكون بترك ما يشك فيه الإنسان.\n3 - أن طمأنينة القلب علامة على أن الأمر لا ريبة فيه غالباً.\n4 - أن القلق والشك علامة على أن في الأمر ريبة غالباً.\n5 - هذا الحديث أصل في الأخذ باليقين وترك الشك."
  },
  {
    "hadith": "الحديث الثاني عشر: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ». (حديث حسن رواه الترمذي وغيره هكذا).",
    "description": "الشرح\nالحديث الثاني عشر: أدب عظيم من آداب الإسلام.\n«مِنْ حُسْنِ إسْلَامِ الْمَرْءِ» أي: من علامات كمال إسلام الشخص وجماله.\n«تَرْكُهُ مَا لَا يَعْنِيهِ» أي: تركه للأمور التي لا تهمه ولا تتعلق به، سواء كانت أقوالاً أو أفعالاً، وسواء كانت أمور دنيا أو دين لا تلزمه.\n(ما لا يعنيه) أي: ما لا يهمه ولا يحتاج إليه ولا تدعو إليه ضرورة أو مصلحة شرعية.\nوهذا يشمل: فضول الكلام، وفضول النظر، وفضول الاستماع، وفضول السؤال، والتدخل في شؤون الآخرين الخاصة التي لا علاقة له بها، والاشتغال بما لا فائدة فيه.\nوالاشتغال بما لا يعني يضيع الوقت، ويقسي القلب، وقد يجر إلى الغيبة والنميمة والكذب وغيرها من آفات اللسان والقلب.\nأما ما يعني المسلم، فهو ما يتعلق بضروريات دينه ودنياه، وما يعود عليه بالنفع في العاجل أو الآجل، كطلب العلم النافع، والعمل الصالح، والأمر بالمعروف والنهي عن المنكر، وإصلاح ذات البين، والسعي في قضاء حوائج المسلمين.\nمن فوائد هذا الحديث:\n1 - الحث على الاشتغال بما ينفع وترك ما لا ينفع.\n2 - أن ترك ما لا يعني من علامات كمال الإسلام وحسنه.\n3 - أن الاشتغال بما لا يعني يدل على ضعف الإسلام ونقصانه.\n4 - أهمية حفظ الوقت فيما يعود بالنفع على الإنسان في دينه ودنياه.\n5 - أن تدخل الإنسان فيما لا يعنيه قد يجلب له الضرر أو يوقعه في الإثم."
  },
  {
    "hadith": "الحديث الثالث عشر: عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ النَّبِيِّ صلى الله عليه وسلم قَالَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث الثالث عشر: أصل في بيان حقوق الأخوة الإيمانية.\n«لَا يُؤْمِنُ أَحَدُكُمْ» أي: لا يبلغ الإيمان الكامل الواجب. وليس المراد نفي أصل الإيمان.\n«حَتَّى يُحِبَّ لِأَخِيهِ» المراد بالأخ هنا: الأخ في الإسلام.\n«مَا يُحِبُّ لِنَفْسِهِ» أي: من الخير. فيحب لأخيه المسلم حصول الخير الذي يحبه لنفسه، ويكره له حصول الشر الذي يكرهه لنفسه.\nوهذا يشمل أمور الدين والدنيا. فيحب له الهداية والصلاح والاستقامة والرزق الحلال والصحة والعافية وكل خير يحبه لنفسه.\nوهذا لا يعني أن يتمنى زوال النعمة عن أخيه لتصل إليه، فهذا حسد مذموم. بل يحب له حصول الخير كما يحبه لنفسه.\nوهذا من كمال الإيمان، ودليل على سلامة القلب من الغل والحسد والبغضاء، ومحبة الخير للمسلمين.\nمن فوائد هذا الحديث:\n1 - الحث على محبة الخير للمسلمين.\n2 - أن محبة الخير للمسلم من كمال الإيمان الواجب.\n3 - النهي عن الحسد والبغضاء والغل.\n4 - عظم حق الأخوة الإيمانية.\n5 - أن المؤمنين كالجسد الواحد يحب بعضهم لبعض ما يحب لنفسه."
  },
    {
    "hadith": "الحديث الرابع عشر: عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث الرابع عشر: بيان الأمور التي تبيح دم المسلم المعصوم الأصل.\n«لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ» أي: يحرم قتله.\n«يَشْهَدُ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ» هذا وصف للمسلم الذي عصم دمه بالإسلام.\n«إلَّا بِإِحْدَى ثَلَاثٍ» أي: لا يباح قتله إلا بإحدى هذه الخصال الثلاث:\n1 - «الثَّيِّبُ الزَّانِي» الثيب: هو من سبق له الزواج الصحيح (وطء في نكاح صحيح). فإذا زنى بعد إحصانه، فحده الرجم حتى الموت.\n2 - «وَالنَّفْسُ بِالنَّفْسِ» أي: القاتل عمداً عدواناً، فإنه يقتل قصاصاً بنفس النفس التي قتلها، بشروط معروفة في كتب الفقه.\n3 - «وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ» وهو المرتد عن الإسلام. فإنه يستتاب، فإن تاب وإلا قتل. ومفارقة الجماعة قد تكون بالردة، أو بالخروج على الإمام وبث الفتن والحرابة ونحو ذلك مما يبيح قتله.\nفهذه الثلاثة هي الأصول التي تبيح دم المسلم بعد إسلامه.\nوهناك أسباب أخرى ذكرت في نصوص أخرى غير هذه الثلاث، كقتل الساحر، وقتل من عمل عمل قوم لوط (اللواط)، ومن يفرق جماعة المسلمين ويشق عصا الطاعة، والمحارب.\nمن فوائد هذا الحديث:\n1 - حرمة دم المسلم وعظم شأنه.\n2 - أن الأصل في دم المسلم العصمة.\n3 - بيان الحالات التي يباح فيها دم المسلم.\n4 - إثبات حد الرجم للزاني المحصن.\n5 - إثبات القصاص في القتل العمد.\n6 - إثبات قتل المرتد عن الإسلام."
  },
  {
    "hadith": "الحديث الخامس عشر: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث الخامس عشر: يجمع أصولاً من مكارم الأخلاق وحقوق العباد المتعلقة بالإيمان.\nربط النبي صلى الله عليه وسلم هذه الأعمال بالإيمان بالله واليوم الآخر يدل على أنها من لوازم الإيمان ومقتضياته، وأن الإيمان الحقيقي يحمل صاحبه على القيام بها.\n«مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ» أي: إيماناً كاملاً صادقاً.\n«فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ» هذا في أدب اللسان. فالإنسان إما أن يتكلم بالخير (كذكر الله، وقراءة القرآن، والعلم النافع، والأمر بالمعروف والنهي عن المنكر، والإصلاح بين الناس، والكلام الطيب)، وإما أن يسكت ويمسك لسانه عن الشر وفضول الكلام (كالغيبة والنميمة والكذب واللغو والسب والشتم).\n«وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ» هذا في حق الجار. وإكرام الجار يكون بكف الأذى عنه، والإحسان إليه بالقول والفعل، وتفقد أحواله، ومواساته، ونصحه، وحفظه في غيبته. والجيران ثلاثة: جار مسلم له قرابة (له ثلاثة حقوق: حق الجوار، وحق الإسلام، وحق القرابة)، وجار مسلم ليس له قرابة (له حقان: حق الجوار، وحق الإسلام)، وجار كافر (له حق الجوار).\n«وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ» هذا في حق الضيف. وإكرام الضيف يكون بطلاقة الوجه، وطيب الكلام، وتقديم ما تيسر من الطعام والشراب له، وإيوائه إذا احتاج. والضيافة الواجبة يوم وليلة، والكمال ثلاثة أيام، وما زاد فهو صدقة.\nمن فوائد هذا الحديث:\n1 - أن حفظ اللسان وإكرام الجار وإكرام الضيف من علامات الإيمان الصادق بالله واليوم الآخر.\n2 - الحث على الكلام بالخير أو السكوت عن الشر.\n3 - وجوب إكرام الجار والإحسان إليه وكف الأذى عنه.\n4 - وجوب إكرام الضيف والقيام بحقه.\n5 - أن الإيمان ليس مجرد تصديق بالقلب، بل هو قول وعمل يزيد بالطاعة وينقص بالمعصية."
  },
  {
    "hadith": "الحديث السادس عشر: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه وسلم : أَوْصِنِي. قَالَ: «لَا تَغْضَبْ». فَرَدَّدَ مِرَارًا، قَالَ: «لَا تَغْضَبْ». (رواه البخاري).",
    "description": "الشرح\nالحديث السادس عشر: وصية عظيمة جامعة لخيري الدنيا والآخرة.\n«أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه وسلم : أَوْصِنِي» أي: اطلب مني وصية موجزة جامعة.\n«قَالَ: لَا تَغْضَبْ» الغضب: هو ثوران النفس، وتغير يحصل عند غليان دم القلب ليحصل عنه التشفي للصدر.\nوالنهي عن الغضب له معنيان:\nالأول: النهي عن أسبابه، بأن يتخلق الإنسان بالأخلاق الحسنة كالحلم والأناة والرفق، فيبتعد عن أسباب الغضب.\nالثاني: النهي عن تنفيذ مقتضى الغضب إذا حصل، بأن يملك نفسه عند الغضب فلا يقع في قول أو فعل محرم.\n«فَرَدَّدَ مِرَارًا» أي: كرر الرجل طلب الوصية، لعله يوصيه بشيء آخر أهم أو أنفع.\n«قَالَ: لَا تَغْضَبْ» كرر النبي صلى الله عليه وسلم نفس الوصية، تأكيداً لأهميتها وأنها جامعة.\nوالغضب مفتاح لكثير من الشرور، فكم من جريمة وقعت بسبب الغضب، وكم من طلاق حصل بسببه، وكم من قطيعة رحم حدثت بسببه.\nوعلاج الغضب يكون بأمور منها:\n1 - الاستعاذة بالله من الشيطان الرجيم.\n2 - تغيير الهيئة التي هو عليها، فإن كان قائماً جلس، وإن كان جالساً اضطجع.\n3 - الوضوء.\n4 - السكوت.\n5 - تذكر فضل كظم الغيظ والعفو عن الناس.\nمن فوائد هذا الحديث:\n1 - حرص الصحابة على طلب الوصية النافعة.\n2 - أهمية الوصية بـ «لا تغضب» وأنها وصية جامعة.\n3 - التحذير من الغضب وآثاره السيئة.\n4 - الحث على تملك النفس عند الغضب وكظم الغيظ.\n5 - بيان بعض طرق علاج الغضب."
  },
  {
    "hadith": "الحديث السابع عشر: عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ: «إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ». (رواه مسلم).",
    "description": "الشرح\nالحديث السابع عشر: في بيان عموم الإحسان في كل شيء.\n«إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ» أي: أوجبه وأمر به. والإحسان: هو الإتقان والإجادة.\n«عَلَى كُلِّ شَيْءٍ» أي: في التعامل مع كل شيء، سواء كان من المخلوقات أو في الأفعال.\n«فَإِذَا قَتَلْتُمْ» أي: إذا أردتم قتل ما يجوز قتله شرعاً، كقتل القصاص، أو قتل البهائم المؤذية، أو قتل الكافر الحربي.\n«فَأَحْسِنُوا الْقِتْلَةَ» أي: اقتلوا على أحسن هيئة وأسرعها وأسهلها، دون تعذيب أو تمثيل.\n«وَإِذَا ذَبَحْتُمْ» أي: ذبح ما يحل أكله من الأنعام والطيور.\n«فَأَحْسِنُوا الذِّبْحَةَ» أي: اذبحوا على أحسن هيئة، بقطع الودجين والحلقوم والمريء بآلة حادة.\n«وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ» أي: ليسن السكين التي يذبح بها جيداً لتكون حادة.\n«وَلْيُرِحْ ذَبِيحَتَهُ» أي: لا يعذبها بالذبح بسكين كالة، أو بحدها أمامها، أو بذبحها أمام أخواتها، أو بتركها تضطرب طويلاً، بل يسرع في إتمام الذبح.\nذكر النبي صلى الله عليه وسلم هذين المثالين (القتل والذبح) وهما مما قد تظن القسوة فيهما، ليبين أن الإحسان مطلوب حتى في هذه المواضع، فكيف بما دونها؟\nوالإحسان يشمل: الإحسان في عبادة الله (وهو أعلى مراتبه)، والإحسان إلى الوالدين، والأقارب، والجيران، واليتامى، والمساكين، والإحسان في القول والفعل، والإحسان إلى البهائم.\nمن فوائد هذا الحديث:\n1 - وجوب الإحسان في كل شيء.\n2 - الأمر بالإحسان حتى في قتل ما يجوز قتله.\n3 - الأمر بالإحسان في ذبح ما يجوز ذبحه.\n4 - من الإحسان في الذبح: حد الشفرة، وإراحة الذبيحة.\n5 - رحمة الشريعة الإسلامية حتى بالحيوان.\n6 - أن الإحسان يشمل جميع الأقوال والأفعال والتعاملات."
  },
  {
    "hadith": "الحديث الثامن عشر: عَنْ أَبِي ذَرٍّ جُنْدُبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ: «اتَّقِ اللَّهَ حَيْثُمَا كُنْتَ، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ». (رواه الترمذي وقال: حديث حسن، وفي بعض النسخ: حسن صحيح).",
    "description": "الشرح\nالحديث الثامن عشر: وصية جامعة لأصول التعامل مع الله ومع النفس ومع الخلق.\n«اتَّقِ اللَّهَ حَيْثُمَا كُنْتَ» التقوى: هي فعل الأوامر واجتناب النواهي. (حيثما كنت) أي: في أي مكان وزمان، في السر والعلانية، في الخلوة والجلوة. فالله مطلع عليك في كل حال.\n«وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا» السيئة: هي المعصية. الحسنة: هي الطاعة. (تمحها) أي: تكفرها وتزيل أثرها. قال تعالى: {إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ} [هود: 114]. والمراد السيئات الصغائر، أما الكبائر فلا بد لها من توبة خاصة. ومن أعظم الحسنات الماحية: التوبة النصوح، والاستغفار، والوضوء، والصلاة، والصدقة، والصيام، والحج، والعمرة، وذكر الله.\n«وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ» أي: عامل الناس بالأخلاق الحسنة من طلاقة الوجه، وبذل الندى، وكف الأذى، والحلم، والصبر، والعفو، والإحسان. والخلق الحسن من أثقل الأعمال في الميزان يوم القيامة.\nفهذه ثلاث وصايا عظيمة:\n1 - وصية تتعلق بحق الله: التقوى.\n2 - وصية تتعلق بحق النفس عند وقوع الزلل: إتباع السيئة بالحسنة.\n3 - وصية تتعلق بحق الخلق: المعاملة بالخلق الحسن.\nمن فوائد هذا الحديث:\n1 - وجوب تقوى الله في كل حال ومكان.\n2 - أن الحسنات تمحو السيئات (الصغائر).\n3 - الحث على المبادرة إلى فعل الحسنات بعد السيئات.\n4 - وجوب معاملة الناس بالخلق الحسن.\n5 - أن الدين يقوم على ثلاثة أصول: تقوى الله، وإصلاح الخلل، وحسن معاملة الخلق."
  },
    {
    "hadith": "الحديث التاسع عشر: عَنْ أَبِي الْعَبَّاسِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُنْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم يَوْمًا فَقَالَ: «يَا غُلَامُ، إنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْكَ، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَكَ، إذَا سَأَلْتَ فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ، وَلَوْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ». (رواه الترمذي وقال: حديث حسن صحيح). وفي رواية غير الترمذي: «احْفَظْ اللَّهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إلَى اللَّهِ فِي الرَّخَاءِ يَعْرِفْكَ فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْرًا».",
    "description": "الشرح\nالحديث التاسع عشر: وصايا عظيمة في التوحيد والتوكل واليقين والإيمان بالقدر.\n«يَا غُلَامُ» هو عبدالله بن عباس رضي الله عنهما، وكان صغيراً آنذاك.\n«إنِّي أُعَلِّمُكَ كَلِمَاتٍ» أي: جملاً نافعة وجيزة.\n«احْفَظْ اللَّهَ يَحْفَظْكَ» حفظ الله يكون بحفظ حدوده وحقوقه وأوامره ونواهيه. وحفظ الله للعبد يكون بحفظه في دينه ودنياه، في بدنه وأهله وماله، وحفظه عند الموت، وحفظه من المهالك والشبهات والشهوات.\n«احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَكَ» (وفي رواية: أمامك) أي: تجده معك بالحفظ والتأييد والنصرة والهداية حيثما توجهت.\n«إذَا سَأَلْتَ فَاسْأَلْ اللَّهَ» أي: إذا أردت طلب حاجة فلا تطلبها إلا من الله، سواء كانت أمور الدنيا أو الآخرة.\n«وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاَللَّهِ» أي: إذا أردت العون على أمر من الأمور فلا تطلب العون إلا من الله.\nوهذا فيه تحقيق التوكل وإفراد الله بالسؤال والاستعانة.\n«وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ» الأمة: جميع الخلق. والمعنى: أن النفع كله بيد الله، وما كتبه لك سيصلك، وما لم يكتبه فلن يصلك ولو اجتمع الخلق كلهم على إيصاله إليك.\n«وَلَوْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ» أي: أن الضر كله بيد الله، وما كتبه عليك سيصيبك، وما لم يكتبه فلن يصيبك ولو اجتمع الخلق كلهم على إيقاعه بك.\nوهذا فيه تحقيق الإيمان بالقدر، وأن كل شيء بقضاء وقدر، مما يورث الطمأنينة واليقين والتوكل على الله وحده.\n«رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ» أي: أن الأمر قد قضي وانتهى، وكتبت المقادير وفرغ منها، ولا تبديل لكلمات الله.\nالرواية الثانية:\n«تَعَرَّفْ إلَى اللَّهِ فِي الرَّخَاءِ يَعْرِفْكَ فِي الشِّدَّةِ» أي: تقرب إلى الله بالطاعة والعبادة في حال الصحة والغنى والفراغ، فإن الله يحفظك وينجيك ويفرج عنك إذا نزلت بك شدة أو كربة.\n«وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ» تأكيد لمعنى الإيمان بالقدر، وأن ما قدره الله كائن لا محالة، وما لم يقدره لن يكون.\n«وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ» أي: أن الصبر على الطاعة وعن المعصية وعلى أقدار الله المؤلمة، سبب لحصول النصر على الأعداء وعلى النفس والشيطان.\n«وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ» أي: أن الشدة والكرب يعقبها الفرج وزوال الهم.\n«وَأَنَّ مَعَ الْعُسْرِ يُسْرًا» كلما اشتد العسر قرب اليسر. قال تعالى: {فَإِنَّ مَعَ الْعُسْرِ يُسْرًا * إِنَّ مَعَ الْعُسْرِ يُسْرًا} [الشرح: 5-6].\nمن فوائد هذا الحديث:\n1 - حرص النبي صلى الله عليه وسلم على تعليم الناشئة.\n2 - فضل حفظ حدود الله وشرعه.\n3 - أن الجزاء من جنس العمل (احفظ الله يحفظك).\n4 - وجوب إفراد الله بالسؤال والاستعانة.\n5 - تحقيق التوكل على الله وحده.\n6 - الإيمان بالقضاء والقدر وأن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك.\n7 - أن النفع والضر بيد الله وحده.\n8 - فضل التقرب إلى الله في الرخاء.\n9 - أن الصبر مفتاح النصر، وأن الفرج يأتي بعد الكرب، وأن اليسر يأتي بعد العسر.\n10 - بشارة للمؤمنين بالفرج والنصر واليسر بعد الشدائد."
  },
  {
    "hadith": "الحديث العشرون: عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ». (رواه البخاري).",
    "description": "الشرح\nالحديث العشرون: في بيان أهمية خلق الحياء وأنه باقٍ من شرائع الأنبياء السابقين.\n«إنَّ مِمَّا أَدْرَكَ النَّاسُ» أي: بلغهم وتوارثوه.\n«مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى» أي: من كلام الأنبياء السابقين وشرائعهم التي لم تنسخ.\n«إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ» الحياء: هو خلق يبعث على ترك القبيح ويمنع من التقصير في حق ذي الحق.\nوهذه الجملة لها معنيان عند العلماء:\nالأول: أنه أمر بمعنى التهديد والوعيد. أي: إذا لم يكن لديك حياء يمنعك من فعل القبائح، فافعل ما تشاء من المعاصي، فإن الله سيجازيك عليه. كقوله تعالى: {اعْمَلُوا مَا شِئْتُمْ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ} [فصلت: 40].\nالثاني: أنه أمر بمعنى الخبر. أي: أن الذي يمنع الإنسان من فعل القبائح هو الحياء، فإذا نزع منه الحياء فإنه يصنع كل ما يشتهيه من القبائح والمنكرات ولا يبالي.\nالثالث: أنه أمر بمعنى الإباحة. أي: إذا كان الفعل الذي تريد فعله لا يستحيا منه، لا شرعاً ولا عرفاً، وهو من أفعال الخير والطاعة، فافعله ولا تتردد بسبب حياء مذموم يمنعك من الخير.\nوالمعنيان الأول والثاني أظهر وأشهر.\nوالحياء نوعان:\n1 - حياء فطري (غريزي): وهو الذي يخلق مع الإنسان، كالحياء من كشف العورة.\n2 - حياء مكتسب (إيماني): وهو الذي يمنع المؤمن من فعل ما يعاب شرعاً، وهو من الإيمان.\nوالحياء كله خير، ولا يأتي إلا بخير.\nمن فوائد هذا الحديث:\n1 - أهمية خلق الحياء وعظم شأنه.\n2 - أن الحياء من كلام النبوات السابقة ومما اتفقت عليه الشرائع.\n3 - أن الحياء رادع عن فعل القبائح والمعاصي.\n4 - أن من فقد الحياء تجرأ على كل قبيح ومنكر.\n5 - التهديد والوعيد لمن لا يستحي فيفعل ما يشاء من المعاصي.\n6 - أن الحياء من الإيمان."
  },
  {
    "hadith": "الحديث الحادي والعشرون: عَنْ أَبِي عَمْرٍو وَقِيلَ: أَبِي عَمْرَةَ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ، قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ. قَالَ: «قُلْ: آمَنْتُ بِاَللَّهِ، ثُمَّ اسْتَقِمْ». (رواه مسلم).",
    "description": "الشرح\nالحديث الحادي والعشرون: وصية جامعة تجمع بين صحة الاعتقاد وسلامة العمل.\n«قُلْتُ: يَا رَسُولَ اللَّهِ، قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ» أي: علمني كلمة جامعة لمجامع الإسلام، واضحة بينة، تكفيني عن سؤال غيرك بعدها.\n«قَالَ: قُلْ: آمَنْتُ بِاَللَّهِ» الإيمان بالله: هو التصديق الجازم بوجوده وربوبيته وألوهيته وأسمائه وصفاته. وهذا يمثل صلاح الباطن والاعتقاد.\n«ثُمَّ اسْتَقِمْ» الاستقامة: هي لزوم طاعة الله ورسوله صلى الله عليه وسلم على الدوام، والثبات على ذلك ظاهراً وباطناً. وهذا يمثل صلاح الظاهر والعمل.\nفجمع النبي صلى الله عليه وسلم لهذا الصحابي الدين كله في هاتين الكلمتين: الإيمان بالله (صلاح الباطن)، والاستقامة على أمره (صلاح الظاهر).\nوالاستقامة تشمل فعل جميع الطاعات وترك جميع المنهيات، والثبات على ذلك حتى الممات.\nمن فوائد هذا الحديث:\n1 - حرص الصحابة على طلب العلم النافع والوصايا الجامعة.\n2 - أن الإيمان بالله هو أساس الدين.\n3 - وجوب الاستقامة على أمر الله ظاهراً وباطناً.\n4 - أن الدين يجمع بين صحة الاعتقاد (الإيمان) وصحة العمل (الاستقامة).\n5 - أن الاستقامة هي الثبات على الدين ولزوم طاعة الله ورسوله."
  },
  {
    "hadith": "الحديث الثاني والعشرون: عَنْ أَبِي عَبْدِ اللَّهِ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ: أَرَأَيْتَ إذَا صَلَّيْتُ الْمَكْتُوبَاتِ، وَصُمْتُ رَمَضَانَ، وَأَحْلَلْتُ الْحَلَالَ، وَحَرَّمْتُ الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا، أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: «نَعَمْ». (رواه مسلم). (ومعنى: «حَرَّمْت الْحَرَامَ»: اجْتَنَبْته. ومعنى: «أَحْلَلْت الْحَلَالَ»: فَعَلْته مُعْتَقِدًا حِلَّهُ).",
    "description": "الشرح\nالحديث الثاني والعشرون: في بيان أن الاقتصار على فعل الواجبات وترك المحرمات سبب لدخول الجنة.\n«أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ: أَرَأَيْتَ» أي: أخبرني.\n«إذَا صَلَّيْتُ الْمَكْتُوبَاتِ» أي: الصلوات الخمس المفروضة.\n«وَصُمْتُ رَمَضَانَ» أي: أديت صيام شهر رمضان الواجب.\n«وَأَحْلَلْتُ الْحَلَالَ» أي: اعتقدت حل ما أحله الله وفعلته إن شئت.\n«وَحَرَّمْتُ الْحَرَامَ» أي: اعتقدت حرمة ما حرمه الله واجتنبته.\n«وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا» أي: لم أفعل من النوافل شيئاً، واقتصرت على الواجبات وتركت المحرمات.\n«أَأَدْخُلُ الْجَنَّةَ؟» هل يكفي ذلك لدخول الجنة؟\n«قَالَ: نَعَمْ» أي: نعم، تدخل الجنة إذا فعلت ذلك.\nوهذا الحديث يدل على أن من قام بالواجبات وانتهى عن المحرمات فهو من أهل الجنة، وإن لم يأت بالنوافل.\nولكن فعل النوافل يزيد في درجات العبد في الجنة ويجبر نقص الفرائض.\nوقوله: (أحللت الحلال وحرمت الحرام) يشمل جميع ما أحله الله وما حرمه من الأقوال والأفعال والمعاملات والمآكل والمشارب وغيرها.\nمن فوائد هذا الحديث:\n1 - أن فعل الواجبات وترك المحرمات سبب لدخول الجنة.\n2 - أهمية الصلوات الخمس وصيام رمضان.\n3 - وجوب اعتقاد حل الحلال وحرمة الحرام.\n4 - وجوب اجتناب المحرمات.\n5 - فضل الله ورحمته حيث جعل الجنة لمن اقتصر على الواجبات وترك المحرمات.\n6 - أن النوافل زيادة خير وترفع الدرجات."
  },
  {
    "hadith": "الحديث الثالث والعشرون: عَنْ أَبِي مَالِكٍ الْحَارِثِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «الطَّهُورُ شَطْرُ الْإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ - أَوْ تَمْلَأُ - مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو، فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا». (رواه مسلم).",
    "description": "الشرح\nالحديث الثالث والعشرون: حديث عظيم في فضل الطهارة والذكر والصلاة والصدقة والصبر والقرآن.\n«الطَّهُورُ شَطْرُ الْإِيمَانِ» الطهور: بالضم هو الفعل (التطهر)، وبالفتح هو الماء. المراد هنا الفعل. شطر الإيمان: نصفه. قيل: لأن الإيمان قسمان: تطهير الظاهر (بالوضوء والغسل) وتطهير الباطن (بالتوحيد والإخلاص)، فكان الطهور الظاهر نصف الإيمان. وقيل: المراد بالإيمان هنا الصلاة، كما في قوله تعالى: {وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ} [البقرة: 143] أي صلاتكم. والطهارة شرط لصحة الصلاة، فكانت كالنصف منها.\n«وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ» أي: ثواب قول (الحمد لله) يملأ ميزان العبد بالحسنات يوم القيامة لعظمها.\n«وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ - أَوْ تَمْلَأُ - مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» (سبحان الله) تعظيم وتنزيه لله عن النقائص. (الحمد لله) ثناء على الله بصفات الكمال. وهاتان الكلمتان لفضلهما يملأ ثوابهما ما بين السماء والأرض.\n«وَالصَّلَاةُ نُورٌ» أي: نور لصاحبها في قلبه ووجهه ويوم القيامة، ونور يهتدي به في أمور دينه ودنياه، تمنعه من المعاصي وترشده إلى الخير.\n«وَالصَّدَقَةُ بُرْهَانٌ» أي: دليل وحجة على صدق إيمان صاحبها، لأن المال محبوب للنفس، وبذله في سبيل الله دليل على إيثار ما عند الله.\n«وَالصَّبْرُ ضِيَاءٌ» الضياء: هو النور الذي فيه حرارة وإحراق (كضياء الشمس). والصبر كذلك فيه مشقة وتعب على النفس، ولكنه يضيء لصاحبه الطريق ويكشف له ظلمات الكرب.\nوالصبر ثلاثة أنواع: صبر على طاعة الله، وصبر عن معصية الله، وصبر على أقدار الله المؤلمة.\n«وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ» أي: حجة لك إن عملت به واتبعت أوامره واجتنبت نواهيه، فيشفع لك ويدافع عنك. وحجة عليك إن أعرضت عنه ولم تعمل به، فيشهد عليك ويخاصمك.\n«كُلُّ النَّاسِ يَغْدُو» أي: يخرج في الصباح ساعياً وكادحاً.\n«فَبَائِعٌ نَفْسَهُ» أي: يعمل ويبيع نفسه.\n«فَمُعْتِقُهَا» أي: من عذاب الله، وذلك ببيعها لله بطاعته واتباع مرضاته.\n«أَوْ مُوبِقُهَا» أي: مهلكها، وذلك ببيعها للشيطان والهوى باتباع الشهوات وارتكاب المعاصي.\nفالناس قسمان: ساعٍ في فكاك نفسه من النار، وساعٍ في إهلاكها.\nمن فوائد هذا الحديث:\n1 - فضل الطهارة وأنها نصف الإيمان.\n2 - فضل الحمد والتسبيح وعظم ثوابهما.\n3 - فضل الصلاة وأنها نور للمؤمن.\n4 - فضل الصدقة وأنها برهان على صدق الإيمان.\n5 - فضل الصبر وأنه ضياء للمؤمن.\n6 - أن القرآن حجة للمؤمن العامل به أو حجة عليه إن أعرض عنه.\n7 - أن كل إنسان ساعٍ، فإما في طاعة الله ليعتق نفسه، وإما في معصية الله ليهلكها.\n8 - الحث على اغتنام العمر في طاعة الله."
  },
    {
    "hadith": "الحديث الرابع والعشرون: عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى أَنَّهُ قَالَ: «يَا عِبَادِي: إنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا؛ فَلَا تَظَالَمُوا. يَا عِبَادِي: كُلُّكُمْ ضَالٌّ إلَّا مَنْ هَدَيْتُهُ؛ فَاسْتَهْدُونِي أَهْدِكُمْ. يَا عِبَادِي: كُلُّكُمْ جَائِعٌ إلَّا مَنْ أَطْعَمْتُهُ؛ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ. يَا عِبَادِي: كُلُّكُمْ عَارٍ إلَّا مَنْ كَسَوْتُهُ؛ فَاسْتَكْسُونِي أَكْسُكُمْ. يَا عِبَادِي: إنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا؛ فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. يَا عِبَادِي: إنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي، فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إذَا أُدْخِلَ الْبَحْرَ. يَا عِبَادِي: إنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إيَّاهَا؛ فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إلَّا نَفْسَهُ». (رواه مسلم).",
    "description": "الشرح\nالحديث الرابع والعشرون: حديث قدسي جليل يبين كمال غنى الله عن خلقه، وكمال فقر الخلق إليه، ويحث على طلب الحاجات منه وحده، ويحذر من الظلم، ويؤكد على أن الجزاء منوط بالعمل.\n«يَا عِبَادِي: إنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي» الظلم: وضع الشيء في غير موضعه. والله تعالى منزه عن الظلم لكمال عدله وغناه.\n«وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا؛ فَلَا تَظَالَمُوا» أي: حرمت عليكم أن يظلم بعضكم بعضاً في دم أو مال أو عرض.\n«يَا عِبَادِي: كُلُّكُمْ ضَالٌّ إلَّا مَنْ هَدَيْتُهُ؛ فَاسْتَهْدُونِي أَهْدِكُمْ» الأصل في الإنسان الجهل والضلال، والهداية بيد الله وحده، فيجب طلبها منه.\n«يَا عِبَادِي: كُلُّكُمْ جَائِعٌ إلَّا مَنْ أَطْعَمْتُهُ؛ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ» الرزق والإطعام بيد الله، فيجب طلبه منه.\n«يَا عِبَادِي: كُلُّكُمْ عَارٍ إلَّا مَنْ كَسَوْتُهُ؛ فَاسْتَكْسُونِي أَكْسُكُمْ» الكسوة والستر بيد الله، فيجب طلبه منه.\n«يَا عِبَادِي: إنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا؛ فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ» البشر خطاؤون بطبعهم، والله غفور رحيم، فيجب طلب المغفرة منه.\n«يَا عِبَادِي: إنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي» بيان كمال غنى الله عن خلقه، وأن طاعتهم لا تنفعه ومعصيتهم لا تضره.\n«يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ... عَلَى أَتْقَى قَلْبِ رَجُلٍ... مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا» تقوى الخلق كلهم لا تزيد في ملك الله شيئاً.\n«يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ... عَلَى أَفْجَرِ قَلْبِ رَجُلٍ... مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا» فجور الخلق كلهم لا ينقص من ملك الله شيئاً.\n«يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ... قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي... مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إذَا أُدْخِلَ الْبَحْرَ» بيان كمال جود الله وسعة خزائنه، وأن عطاءه لجميع الخلق لا ينقص مما عنده شيئاً يذكر، كنقصان الإبرة من ماء البحر.\n«يَا عِبَادِي: إنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إيَّاهَا» أي: أن الجزاء يوم القيامة مبني على الأعمال التي يحصيها الله ويسجلها.\n«فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ» من وجد في صحيفته خيراً وثواباً، فليعلم أنه بفضل الله وتوفيقه، فليحمد الله عليه.\n«وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إلَّا نَفْسَهُ» من وجد شراً وعقاباً، فليعلم أنه بسبب تقصيره وذنوبه، فلا يلومن إلا نفسه الأمارة بالسوء.\nمن فوائد هذا الحديث:\n1 - تحريم الظلم بكل صوره.\n2 - بيان افتقار العباد إلى الله في الهداية والرزق والمغفرة.\n3 - وجوب طلب الهداية والرزق والستر والمغفرة من الله وحده.\n4 - بيان كمال غنى الله عن خلقه وعن طاعتهم.\n5 - بيان كمال قدرة الله وسعة ملكه وجوده وعطائه.\n6 - أن الله يحصي أعمال العباد ويجازيهم عليها.\n7 - أن التوفيق للخير من فضل الله يستوجب الحمد.\n8 - أن الوقوع في الشر بسبب النفس يستوجب اللوم والتوبة."
  },
  {
    "hadith": "الحديث الخامس والعشرون: عَنْ أَبِي ذَرٍّ رَضِيَ اللهُ عَنْهُ أَيْضًا أَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم : يَا رَسُولَ اللَّهِ، ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ؛ يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ. قَالَ: «أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ؟ إنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةٌ، وَكُلِّ تَكْبِيرَةٍ صَدَقَةٌ، وَكُلِّ تَحْمِيدَةٍ صَدَقَةٌ، وَكُلِّ تَهْلِيلَةٍ صَدَقَةٌ، وَأَمْرٌ بِمَعْرُوفٍ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ». قَالُوا: يَا رَسُولَ اللَّهِ، أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: «أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرٌ». (رواه مسلم).",
    "description": "الشرح\nالحديث الخامس والعشرون: يبين سعة أبواب الخير وأن الصدقة ليست قاصرة على المال.\n«أَنَّ نَاسًا» هم فقراء المهاجرين.\n«قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم : يَا رَسُولَ اللَّهِ، ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ» أهل الدثور: أصحاب الأموال الكثيرة. ذهبوا بالأجور: أي سبقونا وفازوا بالدرجات العالية بسبب قدرتهم على الصدقة بأموالهم.\n«يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ» أي: نحن وهم مشتركون في العبادات البدنية كالصلاة والصيام.\n«وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ» أي: وينفردون عنا بالصدقة بأموالهم الزائدة عن حاجتهم، ونحن لا نستطيع ذلك لفقرنا. فشكوا غبطتهم لإخوانهم الأغنياء وحزنهم على فوات الأجر.\n«قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ؟» أي: بين لهم النبي صلى الله عليه وسلم أن أبواب الصدقة ليست محصورة بالمال، بل هناك صدقات أخرى يمكن للفقير أن يقوم بها.\n«إنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةٌ» قول: سبحان الله.\n«وَكُلِّ تَكْبِيرَةٍ صَدَقَةٌ» قول: الله أكبر.\n«وَكُلِّ تَحْمِيدَةٍ صَدَقَةٌ» قول: الحمد لله.\n«وَكُلِّ تَهْلِيلَةٍ صَدَقَةٌ» قول: لا إله إلا الله.\n«وَأَمْرٌ بِمَعْرُوفٍ صَدَقَةٌ» كل قول أو فعل أمر به الشرع أو حسنه.\n«وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ» كل قول أو فعل نهى عنه الشرع أو قبحه.\n«وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ» البُضع: يطلق على الفرج، والمراد هنا: جماع الرجل زوجته.\n«قَالُوا: يَا رَسُولَ اللَّهِ، أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟» استغرب الصحابة أن يكون في قضاء الشهوة أجر وثواب.\n«قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟» أي: لو زنى، أليس عليه إثم؟ قالوا: بلى.\n«فَكَذَلِكَ إذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرٌ» أي: كما أن وضعها في الحرام سبب للإثم، فوضعها في الحلال (الزواج) بنية صالحة (كالعفاف، وطلب الولد الصالح، وإعفاف الزوجة) سبب للأجر.\nمن فوائد هذا الحديث:\n1 - حرص الصحابة على الخير والتنافس فيه.\n2 - فضل الأغنياء الشاكرين المنفقين.\n3 - سعة أبواب الخير والصدقة، وأنها لا تقتصر على المال.\n4 - فضل الذكر (التسبيح والتكبير والتحميد والتهليل).\n5 - فضل الأمر بالمعروف والنهي عن المنكر.\n6 - أن المباحات تصير طاعات بالنيات الصالحة.\n7 - أن إتيان الرجل أهله بنية صالحة فيه أجر وصدقة.\n8 - جواز القياس في الأمور الشرعية."
  },
  {
    "hadith": "الحديث السادس والعشرون: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ: تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ». (رواه البخاري ومسلم).",
    "description": "الشرح\nالحديث السادس والعشرون: في بيان وجوب الصدقة عن كل مفصل من مفاصل الإنسان كل يوم، وبيان أنواع من الصدقات غير المالية.\n«كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ» السلامى: هي المفاصل. وفي الإنسان 360 مفصلاً كما جاء في حديث آخر. والمعنى: على كل مفصل من مفاصل الإنسان صدقة يتصدق بها شكراً لله على نعمة هذه المفاصل التي بها يتحرك ويعمل.\n«كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ» أي: هذه الصدقة واجبة كل يوم.\nثم ذكر النبي صلى الله عليه وسلم أمثلة لأعمال الخير التي تجزئ عن هذه الصدقات:\n«تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ» أي: تصلح بين متخاصمين بالعدل.\n«وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا» تساعده ليركب دابته (سيارته الآن مثلاً).\n«أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ» تساعده في رفع أغراضه وحاجياته على دابته أو سيارته.\n«وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ» تشمل ذكر الله، وقراءة القرآن، والأمر بالمعروف والنهي عن المنكر، والكلام الحسن للناس.\n«وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إلَى الصَّلَاةِ صَدَقَةٌ» المشي إلى المساجد لأداء الصلوات.\n«وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ» إزالة ما يؤذي المارة في الطريق، كحجر أو شوك أو قذر.\nوجاء في حديث آخر أن صلاة الضحى (ركعتي الضحى) تجزئ عن هذه الصدقات كلها.\nمن فوائد هذا الحديث:\n1 - وجوب الصدقة كل يوم عن كل مفصل من مفاصل الإنسان شكراً لله.\n2 - عدد مفاصل الإنسان 360 مفصلاً.\n3 - بيان سعة أبواب الخير والصدقات وأنها لا تقتصر على المال.\n4 - فضل الإصلاح بين الناس بالعدل.\n5 - فضل إعانة المسلم في أموره.\n6 - فضل الكلمة الطيبة.\n7 - فضل المشي إلى الصلاة.\n8 - فضل إماطة الأذى عن الطريق.\n9 - أن ركعتي الضحى تجزئ عن صدقات المفاصل."
  },
  {
    "hadith": "الحديث السابع والعشرون: عَنْ النَّوَّاسِ بْنِ سَمْعَانَ الْأَنْصَارِيِّ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه وسلم قَالَ: «الْبِرُّ حُسْنُ الْخُلُقِ، وَالْإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ». (رواه مسلم). وَعَنْ وَابِصَةَ بْنِ مَعْبَدٍ رَضِيَ اللهُ عَنْهُ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ: «جِئْتَ تَسْأَلُ عَنْ الْبِرِّ وَالْإِثْمِ؟» قُلْتُ: نَعَمْ. قَالَ: «اسْتَفْتِ قَلْبَكَ؛ الْبِرُّ مَا اطْمَأَنَّتْ إلَيْهِ النَّفْسُ وَاطْمَأَنَّ إلَيْهِ الْقَلْبُ، وَالْإِثْمُ مَا حَاكَ فِي الْقَلْبِ وَتَرَدَّدَ فِي الصَّدْرِ، وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ». (حديث حسن رويناه في مسندي الإمامين أحمد بن حنبل والدارمي بإسناد حسن).",
    "description": "الشرح\nالحديث السابع والعشرون: يجمع تعريفاً جامعاً للبر والإثم، ويعطي علامة يعرف بها الإثم في قلب المؤمن.\nحديث النواس بن سمعان:\n«الْبِرُّ حُسْنُ الْخُلُقِ» البر: كلمة جامعة لكل خير وطاعة. وحسن الخلق: هو معاملة الخلق بالجميل من الأقوال والأفعال. فجعل النبي صلى الله عليه وسلم حسن الخلق هو جماع البر. وهذا يدل على عظم منزلة حسن الخلق.\n«وَالْإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ» الإثم: هو الذنب والمعصية. (حاك في صدرك): أي تردد فيه القلب ولم يطمئن إليه، وشعرت فيه بشيء من الشك والريبة والقلق. (وكرهت أن يطلع عليه الناس): لأن صاحبه يعلم أنه ليس من الأمور المحمودة التي يفتخر بها، فيكره أن يراه الناس عليها. هاتان علامتان يعرف بهما الإثم في قلب المؤمن صاحب الفطرة السليمة.\nحديث وابصة بن معبد:\n«جِئْتَ تَسْأَلُ عَنْ الْبِرِّ وَالْإِثْمِ؟» هذه من معجزات النبي صلى الله عليه وسلم حيث أخبر وابصة بما في نفسه قبل أن يسأل.\n«اسْتَفْتِ قَلْبَكَ» أي: ارجع إلى قلبك واستشره. وهذا لمن كان قلبه سليماً مطمئناً بالإيمان والتقوى، وليس لأصحاب القلوب المريضة أو المتبعة للهوى.\n«الْبِرُّ مَا اطْمَأَنَّتْ إلَيْهِ النَّفْسُ وَاطْمَأَنَّ إلَيْهِ الْقَلْبُ» أي: البر هو العمل الذي تسكن إليه النفس ويرتاح له القلب ولا يشعر فيه بتردد أو قلق.\n«وَالْإِثْمُ مَا حَاكَ فِي الْقَلْبِ وَتَرَدَّدَ فِي الصَّدْرِ» تأكيد لمعنى الإثم المذكور في حديث النواس.\n«وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ» أي: حتى لو أباحه لك الناس وأجازوه، لكن قلبك لم يطمئن إليه وتشعر فيه بالريبة، فاتركه. وهذا في الأمور المشتبهة التي ليس فيها نص واضح، أو في حال تعارض الفتاوى.\nمن فوائد هذا الحديث:\n1 - فضل حسن الخلق وأنه جماع البر.\n2 - بيان علامة الإثم في قلب المؤمن: التردد في الصدر وكراهة اطلاع الناس عليه.\n3 - جواز الاعتماد على فتوى القلب السليم المطمئن بالإيمان عند الاشتباه وعدم وجود نص.\n4 - أن البر ما تطمئن إليه النفس والقلب.\n5 - أن الحرام ما يجد الإنسان في قلبه حرجاً منه وقلقاً.\n6 - لا عبرة بفتوى المفتين إذا لم يطمئن لها قلب المستفتي المؤمن التقي، وكان الأمر مشتبهاً."
  },
  {
    "hadith": "الحديث الثامن والعشرون: عَنْ أَبِي نَجِيحٍ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللهُ عَنْهُ قَالَ: وَعَظَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللَّهِ! كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا. قَالَ: «أُوصِيكُمْ بِتَقْوَى اللَّهِ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ؛ فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا؛ فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ؛ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ». (رواه أبو داود والترمذي وقال: حديث حسن صحيح).",
    "description": "الشرح\nالحديث الثامن والعشرون: وصية عظيمة في لزوم التقوى والسمع والطاعة للأمراء، والتمسك بالسنة والحذر من البدع، خاصة عند ظهور الاختلاف.\n«وَعَظَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ» أي: موعظة بليغة مؤثرة أورثت الخوف في القلوب والبكاء في العيون.\n«فَقُلْنَا: يَا رَسُولَ اللَّهِ! كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا» شعروا من بلاغتها وقوتها أنها كوصية من سيفارقهم، فطلبوا وصية خاصة جامعة.\n«قَالَ: أُوصِيكُمْ بِتَقْوَى اللَّهِ» هذه وصية الله للأولين والآخرين، وهي جماع كل خير.\n«وَالسَّمْعِ وَالطَّاعَةِ» أي: لولاة أمور المسلمين.\n«وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ» أي: ولو كان الأمير عبداً حبشياً (وهذا مثال للمبالغة)، ما دام مسلماً يقود بكتاب الله، فتجب له السمع والطاعة في غير معصية الله؛ لما في ذلك من اجتماع الكلمة وصلاح الأمة وحقن الدماء.\n«فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا» إخبار عما سيقع في الأمة من الاختلاف في الدين والدنيا.\n«فَعَلَيْكُمْ بِسُنَّتِي» أي: فالزموا طريقتي وهديي عند وقوع الاختلاف.\n«وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ» هم أبو بكر وعمر وعثمان وعلي رضي الله عنهم. وسنتهم متبعة لأنها موافقة لسنة النبي صلى الله عليه وسلم.\n«عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ» النواجذ: الأضراس. وهذا كناية عن شدة التمسك بالسنة ولزومها.\n«وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ» أي: احذروا الأمور المبتدعة في الدين التي لم تكن على عهد النبي صلى الله عليه وسلم وأصحابه.\n«فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ» كل ما أحدث في الدين على غير مثال سابق فهو بدعة، وكل بدعة ضلالة تؤدي إلى النار. وليس في الدين بدعة حسنة.\nمن فوائد هذا الحديث:\n1 - استحباب الموعظة الحسنة المؤثرة.\n2 - الوصية بتقوى الله تعالى.\n3 - وجوب السمع والطاعة لولاة أمور المسلمين في غير معصية الله.\n4 - الإخبار عما سيقع من الاختلاف في الأمة.\n5 - وجوب التمسك بسنة النبي صلى الله عليه وسلم وسنة الخلفاء الراشدين عند الاختلاف.\n6 - التأكيد على شدة التمسك بالسنة.\n7 - التحذير الشديد من البدع والمحدثات في الدين.\n8 - أن كل بدعة في الدين ضلالة."
  },
    {
    "hadith": "الحديث التاسع والعشرون: عَنْ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللهُ عَنْهُ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدُنِي مِنْ النَّارِ. قَالَ: «لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ: تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ». ثُمَّ قَالَ: «أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ». ثُمَّ تَلَا: {تَتَجَافَى جُنُوبُهُمْ عَنْ الْمَضَاجِعِ} حَتَّى بَلَغَ {يَعْمَلُونَ} [السجدة: 16-17]. ثُمَّ قَالَ: «أَلَا أُخْبِرُكَ بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ؟» قُلْتُ: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: «رَأْسُ الْأَمْرِ الْإِسْلَامُ، وَعَمُودُهُ الصَّلَاةُ، وَذِرْوَةُ سَنَامِهِ الْجِهَادُ». ثُمَّ قَالَ: «أَلَا أُخْبِرُكَ بِمَلَاكِ ذَلِكَ كُلِّهِ؟» قُلْتُ: بَلَى يَا رَسُولَ اللَّهِ. فَأَخَذَ بِلِسَانِهِ وَقَالَ: «كُفَّ عَلَيْكَ هَذَا». قُلْتُ: يَا نَبِيَّ اللَّهِ! وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: «ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ! وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ - أَوْ قَالَ: عَلَى مَنَاخِرِهِمْ - إلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟». (رواه الترمذي وقال: حديث حسن صحيح).",
    "description": "الشرح\nالحديث التاسع والعشرون: حديث جامع لأصول الإسلام وأبواب الخير، مع التركيز على خطورة اللسان.\n«قُلْتُ: يَا رَسُولَ اللَّهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدُنِي مِنْ النَّارِ» سؤال عظيم عن أهم ما يطلبه المؤمن.\n«قَالَ: لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ» أي: هذا الأمر عظيم، لكنه سهل على من وفقه الله وأعانه.\nثم ذكر له أركان الإسلام الخمسة التي هي أساس دخول الجنة والنجاة من النار:\n«تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ».\nثم دله على أبواب الخير (النوافل) التي تزيد في القرب من الله والدرجات في الجنة:\n«أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ» أي: وقاية من النار ومن المعاصي.\n«وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ» أي: تكفر الذنوب.\n«وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ» أي: قيام الليل. وهي من أفضل النوافل.\n«ثُمَّ تَلَا: {تَتَجَافَى جُنُوبُهُمْ عَنْ الْمَضَاجِعِ...}» استشهاد بالقرآن على فضل قيام الليل.\nثم بين له أصول الأمر كله:\n«أَلَا أُخْبِرُكَ بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ؟»\n«رَأْسُ الْأَمْرِ الْإِسْلَامُ» أي: أصله وأساسه هو الدخول في الإسلام بالشهادتين.\n«وَعَمُودُهُ الصَّلَاةُ» أي: التي يقوم عليها الإسلام كما يقوم الفسطاط على عموده.\n«وَذِرْوَةُ سَنَامِهِ الْجِهَادُ» ذروة السنام: أعلاه. والجهاد في سبيل الله هو أعلى مراتب الإسلام العملية.\nثم نبهه على ما يملك به الأمر كله:\n«أَلَا أُخْبِرُكَ بِمَلَاكِ ذَلِكَ كُلِّهِ؟» أي: بما يضبط لك هذه الأمور كلها.\n«فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا» أي: احفظ لسانك وامنع شره.\n«قُلْتُ: يَا نَبِيَّ اللَّهِ! وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟» سؤال عن المحاسبة على الكلام.\n«فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ!» كلمة تقال للزجر والتعجب، ولا يقصد معناها (فقدتك أمك). «وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ... إلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟» أي: أن أكثر ما يدخل الناس النار هو ما جنته ألسنتهم من الكلام الحرام كالكفر والغيبة والنميمة والكذب وشهادة الزور وغيرها.\nمن فوائد هذا الحديث:\n1 - فضل سؤال معاذ وحرصه على الخير.\n2 - بيان أركان الإسلام وأنها أساس النجاة.\n3 - فضل النوافل كالصيام والصدقة وقيام الليل.\n4 - أن الإسلام رأس الأمر، والصلاة عموده، والجهاد ذروة سنامه.\n5 - أهمية حفظ اللسان وخطورة آفاته.\n6 - أن أكثر أسباب دخول النار هو حصائد الألسن.\n7 - أن التوفيق للطاعة بيد الله، فينبغي الاستعانة به."
  },
  {
    "hadith": "الحديث الثلاثون: عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومِ بْنِ نَاشِرٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ: «إنَّ اللَّهَ تَعَالَى فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا». (حديث حسن رواه الدارقطني وغيره).",
    "description": "الشرح\nالحديث الثلاثون: تقسيم لأحكام الشريعة وبيان الموقف منها.\n«إنَّ اللَّهَ تَعَالَى فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا» الفرائض: هي الواجبات التي أوجبها الله على عباده (كأركان الإسلام). والمطلوب: أداؤها وعدم تضييعها.\n«وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا» الحدود: لها معنيان: الأول: المحرمات التي نهى الله عنها. الثاني: العقوبات المقدرة على بعض المعاصي. والمطلوب: عدم تجاوز هذه الحدود والوقوع فيما حرم الله أو تعدي عقوباته.\n«وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا» المحرمات: هي المنهيات التي نهى الله عنها. والمطلوب: اجتنابها وعدم الوقوع فيها (انتهاكها).\n«وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ» أي: هناك أمور لم يأت فيها نص صريح بحل أو حرمة أو إيجاب، تركها الله ولم يبين حكمها توسعة ورحمة بالعباد، لا لأنه نسيها، فالله لا ينسى.\n«فَلَا تَبْحَثُوا عَنْهَا» أي: لا تسألوا عنها سؤال تنقيب وتكلف قد يؤدي إلى تحريمها أو إيجابها فيشق عليكم. وهذا محمول على ما كان في زمن النبي صلى الله عليه وسلم، خشية أن ينزل الوحي بالتشديد بسبب السؤال. أما بعد وفاته واستقرار الشريعة، فيجوز البحث للاستنباط ومعرفة الحكم.\nفهذه أربعة أقسام للأحكام:\n1 - فرائض (واجبات): يجب فعلها.\n2 - حدود (محرمات أو عقوبات): يجب عدم تعديها.\n3 - محرمات: يجب اجتنابها.\n4 - مسكوت عنه (عفو): لا يجوز البحث والتنقيب عنه (في زمن التشريع).\nمن فوائد هذا الحديث:\n1 - بيان أقسام أحكام الشريعة.\n2 - وجوب أداء الفرائض وعدم تضييعها.\n3 - وجوب الوقوف عند حدود الله وعدم تجاوزها.\n4 - وجوب اجتناب المحرمات وعدم انتهاكها.\n5 - أن ما سكت عنه الشرع فهو عفو ورحمة.\n6 - النهي عن البحث والتنقيب فيما سكت عنه الشرع (في زمن نزول الوحي).\n7 - إثبات صفة الرحمة لله تعالى، ونفي صفة النسيان عنه."
  },
  {
    "hadith": "الحديث الحادي والثلاثون: عَنْ أَبِي الْعَبَّاسِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: جَاءَ رَجُلٌ إلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: يَا رَسُولَ اللَّهِ! دُلَّنِي عَلَى عَمَلٍ إذَا عَمِلْتُهُ أَحَبَّنِي اللَّهُ وَأَحَبَّنِي النَّاسُ. فَقَالَ: «ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللَّهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّكَ النَّاسُ». (حديث حسن رواه ابن ماجه وغيره بأسانيد حسنة).",
    "description": "الشرح\nالحديث الحادي والثلاثون: في بيان سبب محبة الله ومحبة الناس.\n«جَاءَ رَجُلٌ إلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: يَا رَسُولَ اللَّهِ! دُلَّنِي عَلَى عَمَلٍ إذَا عَمِلْتُهُ أَحَبَّنِي اللَّهُ وَأَحَبَّنِي النَّاسُ» سؤال عن عمل يجمع بين محبة الخالق ومحبة الخلق.\n«فَقَالَ: ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللَّهُ» الزهد في الدنيا: هو ترك ما لا ينفع في الآخرة. وليس المقصود ترك الدنيا بالكلية، بل ترك التعلق بها والحرص عليها وتقديمها على الآخرة. فمن جعل همه الآخرة وزهد في فضول الدنيا وما يشغل عن الله، أحبه الله.\n«وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّكَ النَّاسُ» أي: اترك الطمع فيما في أيدي الناس من الأموال والمناصب وغيرها، ولا تسألهم شيئاً، ولا تتعلق بما عندهم. فمن كان كذلك استراح وأراح، وأحبه الناس؛ لأن الناس لا يحبون من ينافسهم فيما عندهم أو يطمع فيه.\nفمحبة الله تنال بالزهد في الدنيا، ومحبة الناس تنال بالزهد فيما في أيديهم.\nمن فوائد هذا الحديث:\n1 - حرص الصحابة على معرفة أسباب محبة الله ومحبة الناس.\n2 - فضل الزهد في الدنيا وأنه سبب لمحبة الله.\n3 - فضل الزهد فيما عند الناس وأنه سبب لمحبة الناس.\n4 - أن التعلق بالدنيا يمنع محبة الله.\n5 - أن الطمع فيما عند الناس يورث بغضهم."
  },
  {
    "hadith": "الحديث الثاني والثلاثون: عَنْ أَبِي سَعِيدٍ سَعْدِ بْنِ مَالِكِ بْنِ سِنَانٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: «لَا ضَرَرَ وَلَا ضِرَارَ». (حديث حسن رواه ابن ماجه والدارقطني وغيرهما مسنداً. ورواه مالك في الموطأ مرسلاً عن عمرو بن يحيى عن أبيه عن النبي صلى الله عليه وسلم فأسقط أبا سعيد. وله طرق يقوي بعضها بعضاً).",
    "description": "الشرح\nالحديث الثاني والثلاثون: قاعدة عظيمة من قواعد الفقه الإسلامي.\n«لَا ضَرَرَ» أي: لا يجوز لأحد أن يضر غيره ابتداءً.\n«وَلَا ضِرَارَ» أي: لا يجوز مقابلة الضرر بالضرر، أو إلحاق الضرر بمن أضر بك على وجه غير مشروع أو زائد عن حده.\nفالحديث ينفي وقوع الضرر ابتداءً ومقابلةً بغير حق.\nوهذه القاعدة تدخل في أبواب كثيرة من الفقه، مثل: الشفعة، وخيار العيب، ومنع الجار من الإضرار بجاره، ومنع الإضرار بالزوجة، وغير ذلك.\nفكل فعل يترتب عليه ضرر بالغير دون وجه حق فهو ممنوع شرعاً.\nمن فوائد هذا الحديث:\n1 - تحريم إلحاق الضرر بالغير ابتداءً.\n2 - تحريم مقابلة الضرر بالضرر على وجه غير مشروع.\n3 - أن الشريعة جاءت لإزالة الضرر ومنعه.\n4 - هذه القاعدة من القواعد الفقهية الكبرى التي تندرج تحتها مسائل كثيرة."
  },
  {
    "hadith": "الحديث الثالث والثلاثون: عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: «لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنْ الْبَيِّنَةُ عَلَى الْمُدَّعِي، وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ». (حديث حسن رواه البيهقي وغيره هكذا، وبعضه في الصحيحين).",
    "description": "الشرح\nالحديث الثالث والثلاثون: أصل في القضاء وبيان كيفية إثبات الحقوق عند التنازع.\n«لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ» أي: لو أن كل إنسان ادعى حقاً على غيره أعطي هذا الحق بمجرد دعواه.\n«لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ» أي: لترتب على ذلك فساد عظيم، حيث يدعي أناس أموال أناس آخرين أو يدعون عليهم بالقتل، ويأخذون حقوقهم أو يقتلونهم بمجرد الدعوى.\n«لَكِنْ الْبَيِّنَةُ عَلَى الْمُدَّعِي» البينة: هي الحجة والدليل الذي يثبت الحق، كشهادة الشهود أو الأدلة الكتابية أو القرائن القوية. فالمدعي الذي يدعي حقاً على غيره، يجب عليه أن يأتي بالبينة التي تثبت دعواه.\n«وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ» أي: إذا لم يكن للمدعي بينة، وطلبنا من المدعى عليه الجواب فأنكر، فإننا نطلب منه اليمين (الحلف بالله) على نفي ما ادعاه المدعي. فإذا حلف برئت ذمته في الظاهر، وحسابه على الله.\nفهذا الحديث يبين طريق القضاء وفصل الخصومات:\n- المدعي يطالب بالبينة.\n- المدعى عليه إذا أنكر يطالب باليمين (إذا لم يكن للمدعي بينة).\nمن فوائد هذا الحديث:\n1 - لا يجوز الحكم بمجرد الدعوى.\n2 - وجوب إقامة البينة على المدعي لإثبات دعواه.\n3 - وجوب اليمين على المنكر إذا لم يكن للمدعي بينة.\n4 - هذا الحديث أصل عظيم في باب القضاء والدعاوى والبينات.\n5 - حماية الشريعة لأموال الناس ودمائهم وأعراضهم."
  },
    {
    "hadith": "الحديث الرابع والثلاثون: عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: «مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ؛ وَذَلِكَ أَضْعَفُ الْإِيمَانِ». (رواه مسلم).",
    "description": "الشرح\nالحديث الرابع والثلاثون: في بيان مراتب تغيير المنكر ووجوبه بحسب الاستطاعة.\n«مَنْ رَأَى مِنْكُمْ مُنْكَرًا» المنكر: هو كل ما قبحه الشرع ونهى عنه. (رأى) يشمل العلم به وإن لم يره بالعين.\n«فَلْيُغَيِّرْهُ بِيَدِهِ» هذه المرتبة الأولى والأقوى، وهي لمن له ولاية وسلطة، كالأب في بيته، والحاكم في رعيته، وصاحب السلطة في مجال سلطته. ويكون التغيير باليد بإزالة المنكر مباشرة إذا أمكن ذلك دون ترتب مفسدة أكبر.\n«فَإِنْ لَمْ يَسْتَطِعْ» أي: لم يقدر على التغيير باليد، أو خاف ترتب مفسدة أكبر.\n«فَبِلِسَانِهِ» أي: فليغيره بالكلام، بالنصح والتوجيه والوعظ والإنكار بالقول، وبيان حرمة المنكر والتحذير منه. وهذه المرتبة للعلماء ولمن يقدر على الكلام والبيان.\n«فَإِنْ لَمْ يَسْتَطِعْ» أي: لم يقدر على التغيير باللسان، كأن خاف على نفسه ضرراً بالغاً.\n«فَبِقَلْبِهِ» أي: فلينكره بقلبه، بأن يكرهه ويبغضه ويعتقد حرمته ويعزم على أنه لو قدر لغيره. وهذا الإنكار القلبي واجب على كل مسلم في كل حال، ولا يسقط أبداً.\n«وَذَلِكَ أَضْعَفُ الْإِيمَانِ» أي: الإنكار بالقلب فقط هو أدنى مراتب الإيمان المتعلقة بتغيير المنكر. وليس معناه أن صاحبه ضعيف الإيمان مطلقاً، بل إن هذه المرتبة هي أضعف مراتب الإنكار الظاهر.\nمن فوائد هذا الحديث:\n1 - وجوب تغيير المنكر على كل مسلم بحسب استطاعته.\n2 - بيان مراتب تغيير المنكر الثلاث: اليد، ثم اللسان، ثم القلب.\n3 - أن مرتبة التغيير باليد تكون لأصحاب الولاية والسلطة.\n4 - أن مرتبة التغيير باللسان تكون لمن عجز عن اليد وقدر على القول.\n5 - أن مرتبة الإنكار بالقلب واجبة على كل حال ولا تسقط أبداً.\n6 - أن ترك إنكار المنكر بالقلب دليل على ذهاب الإيمان أو ضعفه الشديد.\n7 - أهمية شعيرة الأمر بالمعروف والنهي عن المنكر في صلاح المجتمع."
  },
  {
    "hadith": "الحديث الخامس والثلاثون: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إخْوَانًا. الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ، وَلَا يَخْذُلُهُ، وَلَا يَكْذِبُهُ، وَلَا يَحْقِرُهُ. التَّقْوَى هَاهُنَا» - وَيُشِيرُ إلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ - «بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ. كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ». (رواه مسلم).",
    "description": "الشرح\nالحديث الخامس والثلاثون: يجمع أصولاً عظيمة في تحقيق الأخوة الإيمانية واجتناب ما ينافيها.\nالنهي عن أمور تفسد الأخوة:\n«لَا تَحَاسَدُوا» الحسد: تمني زوال نعمة المحسود. وهو محرم ومن كبائر الذنوب.\n«وَلَا تَنَاجَشُوا» النجش: أن يزيد في ثمن السلعة وهو لا يريد شراءها، ليخدع غيره ويغره ليزيد في الثمن. وهو محرم لأنه خداع وغش.\n«وَلَا تَبَاغَضُوا» البغضاء: الكراهية والعداوة. أي: لا تفعلوا الأسباب الجالبة للبغضاء بينكم.\n«وَلَا تَدَابَرُوا» التدابر: الإعراض والهجران، بأن يولي كل واحد دبره لصاحبه. وهو محرم فوق ثلاثة أيام لغير سبب شرعي.\n«وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ» كأن يذهب إلى من اشترى سلعة في زمن الخيار ويقول له افسخ البيع وأنا أبيعك مثلها بأرخص، أو يذهب إلى البائع ويقول له افسخ وأنا أشتريها منك بأغلى. وكذلك الشراء على شراء أخيه والخطبة على خطبة أخيه.\nالأمر بما يقوي الأخوة:\n«وَكُونُوا عِبَادَ اللَّهِ إخْوَانًا» أي: كونوا متحابين متآلفين كالإخوة في النسب.\nبيان حقوق الأخوة:\n«الْمُسْلِمُ أَخُو الْمُسْلِمِ» تأكيد لمعنى الأخوة.\n«لَا يَظْلِمُهُ» في دم أو مال أو عرض.\n«وَلَا يَخْذُلُهُ» أي: لا يترك نصرته وهو قادر عليها.\n«وَلَا يَكْذِبُهُ» أي: لا يكذب عليه في الحديث.\n«وَلَا يَحْقِرُهُ» أي: لا يستصغره ويزدريه.\n«التَّقْوَى هَاهُنَا - وَيُشِيرُ إلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ -» أي: أن أساس التقوى ومحلها هو القلب، فإذا صلح القلب صلحت الجوارح. ولا عبرة بالظواهر فقط.\n«بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ» أي: يكفيه من الشر هذا الفعل القبيح وهو احتقار أخيه المسلم، لعظمه عند الله.\n«كُلُّ الْمُस्لِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ» تأكيد لحرمة المسلم في دمه وماله وعرضه (وهو موضع المدح والذم منه).\nمن فوائد هذا الحديث:\n1 - النهي عن الحسد والنجش والتباغض والتدابر والبيع على بيع أخيه.\n2 - الأمر بتحقيق الأخوة الإيمانية.\n3 - بيان حقوق المسلم على أخيه المسلم: عدم الظلم والخذلان والكذب والاحتقار.\n4 - أن محل التقوى هو القلب.\n5 - التحذير الشديد من احتقار المسلم.\n6 - تأكيد حرمة دم المسلم وماله وعرضه."
  },
  {
    "hadith": "الحديث السادس والثلاثون: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه وسلم قَالَ: «مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ، وَاَللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ، وَغَشِيَتْهُمْ الرَّحْمَةُ، وَحَفَّتْهُمْ الْمَلَائِكَةُ، وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ، وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ». (رواه مسلم بهذا اللفظ).",
    "description": "الشرح\nالحديث السادس والثلاثون: حديث جامع لفضائل أعمال متنوعة من قضاء حوائج المسلمين وطلب العلم وذكر الله.\nفضائل قضاء حوائج المسلمين:\n«مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا» الكربة: الشدة العظيمة. تنفيسها: تخفيفها وإزالتها.\n«نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ» الجزاء من جنس العمل، وكربات يوم القيامة أشد وأعظم.\n«وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ» المعسر: هو الفقير الذي لا يجد ما يسد به حاجته أو دينه. التيسير عليه: يكون بإنظاره في الدين، أو التجاوز عنه، أو إعانته بالمال.\n«يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ» أي: يسر الله أموره في الدنيا والآخرة.\n«وَمَنْ سَتَرَ مُسْلِمًا» أي: رأى منه عورة أو زلة فسترها ولم يفضحها.\n«سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ» أي: ستر الله عيوبه وذنوبه في الدنيا والآخرة.\n«وَاَللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ» قاعدة عامة: أن من أعان إخوانه المسلمين كان الله في عونه وتوفيقه.\nفضل طلب العلم وحلق الذكر:\n«وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا» أي: خرج وسار في طريق يطلب فيه العلم الشرعي.\n«سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إلَى الْجَنَّةِ» أي: يسر الله له بسبب طلبه للعلم طريقاً يوصله إلى الجنة في الآخرة، أو يوفقه لعمل صالح يكون سبباً لدخول الجنة.\n«وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ» أي: المساجد.\n«يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ» أي: يقرؤون القرآن ويتعلمون معانيه وأحكامه.\n«إلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ» الطمأنينة والوقار.\n«وَغَشِيَتْهُمْ الرَّحْمَةُ» أي: شملتهم رحمة الله.\n«وَحَفَّتْهُمْ الْمَلَائِكَةُ» أي: أحاطت بهم الملائكة تكريماً لهم.\n«وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ» أي: يذكرهم الله ويثني عليهم في الملأ الأعلى عند الملائكة المقربين. وهذا أعظم شرف.\nالاعتبار بالعمل لا بالنسب:\n«وَمَنْ بَطَّأَ بِهِ عَمَلُهُ» أي: من كان عمله الصالح قليلاً أو سيئاً فلم يرفعه إلى منازل الأبرار.\n«لَمْ يُسْرِعْ بِهِ نَسَبُهُ» أي: لم ينفعه شرف نسبه أو مكانة آبائه في رفع درجته عند الله إذا كان عمله مقصراً.\nمن فوائد هذا الحديث:\n1 - فضل تنفيس كربات المؤمنين والتيسير على المعسرين وستر المسلمين.\n2 - أن الجزاء من جنس العمل.\n3 - أن الله يعين العبد الذي يعين إخوانه.\n4 - فضل طلب العلم الشرعي وأنه طريق إلى الجنة.\n5 - فضل الاجتماع في المساجد لتلاوة القرآن وتدارسه.\n6 - فضل أهل حلق الذكر والعلم وما يحصل لهم من السكينة والرحمة وحضور الملائكة وذكر الله لهم.\n7 - أن الاعتبار عند الله بالتقوى والعمل الصالح لا بالأنساب والأحساب."
  },
  {
    "hadith": "الحديث السابع والثلاثون: عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيمَا يَرْوِي عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى قَالَ: «إنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ؛ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إلَى سَبْعِمِائَةِ ضِعْفٍ إلَى أَضْعَافٍ كَثِيرَةٍ. وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً». (رواه البخاري ومسلم في صحيحيهما بهذه الحروف).",
    "description": "الشرح\nالحديث السابع والثلاثون: حديث قدسي يبين كمال فضل الله وعدله ورحمته في كتابة الحسنات والسيئات.\n«إنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ» أي: قدرها في علمه وبين كيفية كتابتها للملائكة.\nثواب الهم بالحسنة وفعلها:\n«فَمَنْ هَمَّ بِحَسَنَةٍ» الهمّ: هو العزم والقصد بالقلب.\n«فَلَمْ يَعْمَلْهَا» أي: تركها لعذر أو لغير عذر (مع بقاء العزم).\n«كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً» بمجرد الهم والعزم الصادق، يكتب له أجر النية كاملاً.\n«وَإِنْ هَمَّ بِهَا فَعَمِلَهَا» أي: عزم عليها وفعلها.\n«كَتَبَهَا اللَّهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إلَى سَبْعِمِائَةِ ضِعْفٍ إلَى أَضْعَافٍ كَثِيرَةٍ» المضاعفة بعشر حسنات هي أقل ما يكون، وتزيد المضاعفة بحسب إخلاص العامل، وحال العمل، وشرفه، والحاجة إليه.\nجزاء الهم بالسيئة وتركها وفعلها:\n«وَإِنْ هَمَّ بِسَيِّئَةٍ» عزم على فعل معصية.\n«فَلَمْ يَعْمَلْهَا» أي: تركها.\n«كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً» إذا كان تركه لها خوفاً من الله تعالى. أما إن تركها عجزاً أو لمانع غير الخوف من الله، فلا يكتب له شيء ولا عليه شيء.\n«وَإِنْ هَمَّ بِهَا فَعَمِلَهَا» أي: عزم عليها وفعلها.\n«كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً» من كمال عدل الله أنه لا يضاعف السيئات، بل تكتب سيئة واحدة كما هي.\nمن فوائد هذا الحديث:\n1 - بيان سعة فضل الله ورحمته وكرمه.\n2 - بيان كمال عدل الله تعالى.\n3 - أن الهم بالحسنة يكتب حسنة كاملة.\n4 - أن فعل الحسنة يضاعف عشر مرات إلى أضعاف كثيرة.\n5 - أن ترك السيئة خوفاً من الله يكتب حسنة كاملة.\n6 - أن فعل السيئة يكتب سيئة واحدة فقط.\n7 - أهمية أعمال القلوب (الهم والعزم والنية)."
  },
  {
    "hadith": "الحديث الثامن والثلاثون: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «إنَّ اللَّهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ». (رواه البخاري).",
    "description": "الشرح\nالحديث الثامن والثلاثون: حديث قدسي جليل في بيان منزلة أولياء الله وفضل الفرائض والنوافل وثمراتها.\nمن هم أولياء الله؟\n«إنَّ اللَّهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ» الولي: هو المؤمن التقي القائم بحقوق الله وحقوق عباده. (عادى لي ولياً): أي أبغضه وآذاه بسبب ولايته لله وتقواه. (آذنته بالحرب): أي أعلمته بأني محارب له. ومن حاربه الله فهو هالك لا محالة. وهذا يدل على عظم مكانة أولياء الله عند الله والدفاع عنهم.\nأفضل ما يتقرب به العبد:\n«وَمَا تَقَرَّبَ إلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ» أي: أن أحب الأعمال إلى الله وأعظمها قربة هي أداء الفرائض والواجبات (كأركان الإسلام وغيرها من الواجبات).\nفضل النوافل وأثرها:\n«وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ» النوافل: هي المستحبات من العبادات بعد الفرائض. والمداومة عليها تورث محبة الله للعبد.\nثمرات محبة الله للعبد:\n«فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا» أي: أن الله يوفقه ويسدده في جوارحه كلها، فلا يسمع إلا ما يرضي الله، ولا يبصر إلا ما يرضي الله، ولا يعمل بيده إلا ما يرضي الله، ولا يمشي برجله إلا إلى ما يرضي الله. وليس المعنى الحلول أو الاتحاد كما يزعم أهل الضلال.\n«وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ» أي: يصير مجاب الدعوة، إذا سأل الله أعطاه.\n«وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ» أي: إذا التجأ إلى الله واستجار به، أجاره الله وأعاذه مما يخاف.\nمن فوائد هذا الحديث:\n1 - بيان من هم أولياء الله (المؤمنون المتقون).\n2 - تحريم معاداة أولياء الله والتحذير من ذلك.\n3 - أن أفضل القربات إلى الله هي أداء الفرائض.\n4 - فضل المداومة على النوافل وأنها سبب لمحبة الله للعبد.\n5 - بيان ثمرات محبة الله للعبد: تسديده في جوارحه، وإجابة دعائه، وإعاذته مما استعاذ منه.\n6 - إثبات صفة المحبة لله تعالى."
  },
    {
    "hadith": "الحديث التاسع والثلاثون: عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: «إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ». (حديث حسن رواه ابن ماجه والبيهقي وغيرهما).",
    "description": "الشرح\nالحديث التاسع والثلاثون: في بيان رفع الإثم والمؤاخذة عن بعض الأفعال الصادرة عن الأمة المحمدية.\n«إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي» أي: عفا وسامح لأجلي عن أمتي في ثلاث حالات:\n1 - «الْخَطَأَ» وهو فعل الشيء عن غير قصد وعمد، أو فعله على وجه يخالف الصواب جهلاً به.\n2 - «وَالنِّسْيَانَ» وهو ذهول القلب عن معلوم.\n3 - «وَمَا اسْتُكْرِهُوا عَلَيْهِ» الإكراه: هو حمل الغير على فعل لا يرضاه بتهديد ونحوه. فمن أكره على فعل محرم أو قول محرم (كالكفر) ففعله أو قاله وقلبه مطمئن بالإيمان فلا إثم عليه.\nفمن فعل محرماً أو ترك واجباً مخطئاً أو ناسياً أو مكرهاً، فإنه لا إثم عليه ولا عقوبة أخروية. وهذا من رحمة الله بهذه الأمة وتخفيفه عنها.\nأما بالنسبة للأحكام الدنيوية المترتبة على هذه الأفعال (كالضمان في إتلاف المال خطأً، أو قضاء الصلاة المنسية)، فهذه لا تسقط بالخطأ والنسيان والإكراه في الغالب، ولها تفصيل في كتب الفقه.\nمن فوائد هذا الحديث:\n1 - بيان رحمة الله الواسعة بهذه الأمة.\n2 - رفع الإثم والمؤاخذة الأخروية عن المخطئ والناسي والمكره.\n3 - أن هذه الأعذار (الخطأ والنسيان والإكراه) لا ترفع دائماً الأحكام الدنيوية المترتبة عليها.\n4 - هذا الحديث أصل في باب الأعذار الشرعية."
  },
  {
    "hadith": "الحديث الأربعون: عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْكِبِي فَقَالَ: «كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ». وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إذَا أَمْسَيْتَ فَلَا تَنْتَظِرْ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرْ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لِمَوْتِكَ. (رواه البخاري).",
    "description": "الشرح\nالحديث الأربعون: وصية بليغة في عدم الركون إلى الدنيا والاستعداد للآخرة.\n«أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْكِبِي» المنكب: مجتمع رأس العضد والكتف. وفعل النبي صلى الله عليه وسلم ذلك لإيقاظ انتباه ابن عمر وإشعاره بأهمية ما سيقول.\n«فَقَالَ: كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ» الغريب: هو المقيم في بلد غير بلده، فهو قلق غير مستقر، يشتاق إلى وطنه، ولا يتخذ هذا البلد دار إقامة دائمة.\n«أَوْ عَابِرُ سَبِيلٍ» عابر السبيل: هو المسافر الذي يمر بالطريق مروراً ولا يقيم فيه. وهو أبلغ في عدم التعلق بالدنيا من الغريب، لأنه لا يقيم أصلاً.\nوالمعنى: لا تركن إلى الدنيا ولا تتخذها وطناً وقراراً، بل كن فيها كالغريب الذي لا يتعلق بغير بلده، أو كالمسافر الذي لا يتعلق إلا بما يبلغه مقصده، وليكن همك الآخرة فهي الدار الحقيقية.\n«وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إذَا أَمْسَيْتَ فَلَا تَنْتَظِرْ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرْ الْمَسَاءَ» هذا تطبيق عملي لوصية النبي صلى الله عليه وسلم. والمعنى: استعد للموت دائماً، ولا تؤمل طول البقاء، فاعمل صالحاً في مسائك كأنك لن تدرك الصباح، واعمل صالحاً في صباحك كأنك لن تدرك المساء. أي: قصر الأمل واستعد للرحيل.\n«وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ» أي: اغتنم وقت الصحة والقوة في العمل الصالح قبل أن يأتي المرض فيعجزك عن العمل.\n«وَمِنْ حَيَاتِكَ لِمَوْتِكَ» أي: اغتنم أيام حياتك في الطاعة والاستعداد لما بعد الموت قبل أن يفجأك الموت فينقطع عملك.\nمن فوائد هذا الحديث:\n1 - شفقة النبي صلى الله عليه وسلم على أمته وحرصه على نصحهم.\n2 - الحث على عدم الركون إلى الدنيا والتعلق بها.\n3 - تشبيه المؤمن في الدنيا بالغريب أو عابر السبيل.\n4 - الحث على قصر الأمل والاستعداد الدائم للموت.\n5 - اغتنام فرصة الصحة والحياة في العمل الصالح قبل فوات الأوان بالمرض أو الموت.\n6 - فضل ابن عمر وفقهه وفهمه لوصية النبي صلى الله عليه وسلم."
  },
  {
    "hadith": "الحديث الحادي والأربعون: عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ». (حديث حسن صحيح رويناه في كتاب الحجة بإسناد صحيح).",
    "description": "الشرح\nالحديث الحادي والأربعون: في بيان أن كمال الإيمان لا يتحقق إلا بموافقة هوى النفس لما جاء به الشرع.\n«لَا يُؤْمِنُ أَحَدُكُمْ» أي: لا يبلغ الإيمان الكامل الواجب.\n«حَتَّى يَكُونَ هَوَاهُ» الهوى: هو ميل النفس ومحبتها وإرادتها.\n«تَبَعًا لِمَا جِئْتُ بِهِ» أي: تابعاً وموافقاً ومنقاداً لما جاء به النبي صلى الله عليه وسلم من الدين والشرع والهدى.\nفالمؤمن كامل الإيمان هو الذي يجعل ميل نفسه ومحبتها وإرادتها تابعة لما يحبه الله ورسوله ويرضاه، فيحب ما أحبه الله ورسوله، ويكره ما كرهه الله ورسوله، ويقدم أمر الشرع على هوى نفسه.\nأما من قدم هوى نفسه على أمر الله ورسوله، أو عارض الشرع بهواه، فهذا دليل على نقص إيمانه.\nمن فوائد هذا الحديث:\n1 - أن كمال الإيمان الواجب لا يحصل إلا بموافقة الهوى للشرع.\n2 - وجوب تقديم أمر الله ورسوله على هوى النفس.\n3 - ذم اتباع الهوى المخالف للشرع.\n4 - أن محبة ما يحبه الله ورسوله وبغض ما يبغضانه من علامات الإيمان.\n5 - أهمية جهاد النفس على مخالفة الهوى واتباع الهدى."
  },
{
    "hadith": "الحديث الثاني والأربعون: عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: «قَالَ اللهُ تَعَالَى: يَا ابْنَ آدَمَ، إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلَا أُبَالِي. يَا ابْنَ آدَمَ، لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتَنِي غَفَرْتُ لَكَ وَلَا أُبَالِي. يَا ابْنَ آدَمَ، إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً». (رواه الترمذي وقال: حديث حسن صحيح).",
    "description": "الشرح\nالحديث الثاني والأربعون: حديث قدسي عظيم يبين سعة رحمة الله ومغفرته.\n«قَالَ اللهُ تَعَالَى» هذا حديث قدسي يرويه النبي صلى الله عليه وسلم عن ربه عز وجل.\n«يَا ابْنَ آدَمَ» خطاب لجميع بني آدم.\n«إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي» أي: ما دمت تدعوني وتسألني المغفرة وترجو رحمتي.\nالدعاء: هو الطلب والسؤال. الرجاء: هو الطمع في فضل الله ورحمته.\n«غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ» أي: مهما كانت ذنوبك كثيرة وعظيمة.\n«وَلَا أُبَالِي» أي: لا أستكثر مغفرة ذنوبك ولا أهتم بها، فهي يسيرة عليّ.\n«يَا ابْنَ آدَمَ، لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ» أي: وصلت إلى السحاب أو ما علا وارتفع من السماء. وهذا كناية عن كثرتها.\n«ثُمَّ اسْتَغْفَرْتَنِي» أي: طلبت مني المغفرة بصدق وإخلاص.\n«غَفَرْتُ لَكَ وَلَا أُبَالِي» تأكيد لسعة المغفرة.\n«يَا ابْنَ آدَمَ، إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الْأَرْضِ خَطَايَا» قراب الأرض: أي ما يقارب ملئها. وهذا مبالغة في كثرة الذنوب.\n«ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا» هذا هو الشرط الأعظم: التوحيد الخالص لله واجتناب الشرك الأكبر.\n«لَأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً» أي: لأعطيتك مغفرة تقارب ملء الأرض.\nمن فوائد هذا الحديث:\n1 - بيان سعة رحمة الله ومغفرته وعفوه.\n2 - فضل الدعاء والرجاء والاستغفار.\n3 - أن أعظم أسباب المغفرة هو التوحيد واجتناب الشرك.\n4 - أن الله يغفر الذنوب جميعاً لمن استغفره وتاب إليه مهما عظمت، ما لم تكن شركاً.\n5 - الحث على حسن الظن بالله تعالى ورجاء مغفرته."
  }
]